-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 19, 2020 at 04:11 AM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test_import_excel`
--

-- --------------------------------------------------------

--
-- Table structure for table `alert`
--

CREATE TABLE `alert` (
  `alert_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `token_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `table_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `alert_date` date NOT NULL,
  `alert_time` time NOT NULL,
  `line_group_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `file_alert_path` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `record_count` int(11) NOT NULL,
  `status` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `data_dic_ref`
--

CREATE TABLE `data_dic_ref` (
  `data_dic_ref_id` int(11) NOT NULL,
  `field_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `column_order` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tb_ref_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `empolyee`
--

CREATE TABLE `empolyee` (
  `id_user` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `leveltest` int(1) NOT NULL,
  `img_em` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `empolyee`
--

INSERT INTO `empolyee` (`id_user`, `username`, `password`, `name`, `leveltest`, `img_em`) VALUES
(1, 'user', '25f9e794323b453885f5181f1b624d0b', 'ประทาน โพธิ์ภู่', 0, '08bd1.png'),
(2, 'admin', '25f9e794323b453885f5181f1b624d0b', 'แกน', 1, 'maxresdefault.jpg'),
(3, '505972', 'fa717c1cae7a7b36f7518a5dfbb4b214', 'สุภัทรา', 0, '');

-- --------------------------------------------------------

--
-- Table structure for table `task_user`
--

CREATE TABLE `task_user` (
  `task_user_id` int(11) NOT NULL COMMENT 'PK',
  `user_id` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ไอดีผู้ใช้',
  `task_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='ตารางเก็บความสัมพันระหว่างงานกับผู้ใช้';

--
-- Dumping data for table `task_user`
--

INSERT INTO `task_user` (`task_user_id`, `user_id`, `task_name`) VALUES
(1, '3', 'TEST');

-- --------------------------------------------------------

--
-- Table structure for table `tb_test2`
--

CREATE TABLE `tb_test2` (
  `table_name_id` int(11) NOT NULL COMMENT 'primary_key',
  `h1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ลำดับที่',
  `h2_1` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'เลขที่รายการ',
  `h2_2` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ชื่อรายการ',
  `h3` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'WBS',
  `h4` double NOT NULL COMMENT 'วงเงินงบประมาณปัจจุบัน',
  `h5` double NOT NULL COMMENT 'รวมจ่ายจริงถึงสิ้นปีก่อนหน้า',
  `h6` double NOT NULL COMMENT 'รวมจ่ายจริงปีปัจจุบัน',
  `h7` double NOT NULL COMMENT 'รวมจ่ายจริง',
  `h8` double NOT NULL COMMENT 'เงินล่วงหน้าปีก่อนหน้า',
  `h9` double NOT NULL COMMENT 'เงินประกันปีก่อนหน้า',
  `h10` double NOT NULL COMMENT 'เงินล่วงหน้าปีปัจจุบัน',
  `h11` double NOT NULL COMMENT 'เงินประกันปีปัจจุบัน',
  `h12` double NOT NULL COMMENT 'เงินล่วงหน้าคงเหลือ',
  `h13` double NOT NULL COMMENT 'เงินประกันค้างจ่าย',
  `h14` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้นปีก่อนหน้า',
  `h15` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้นปีปัจจุบัน',
  `h16` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้น',
  `h17` double NOT NULL COMMENT 'งบประมาณหักรวมจ่ายทั้งสั้น',
  `h18` double NOT NULL COMMENT 'PO หัก รวมจ่ายจริง PO',
  `h19` double NOT NULL COMMENT 'งบประมาณหักรวมจ่ายจริง',
  `h20` double NOT NULL COMMENT 'IR-คงเหลือ',
  `h21` double NOT NULL COMMENT 'GR-คงเหลือ',
  `h22` double NOT NULL COMMENT 'PO-คงเหลือ',
  `h23` double NOT NULL COMMENT 'PR-คงเหลือ',
  `h24` double NOT NULL COMMENT 'วงเงินคงเหลือยังไม่ดำเนินการ',
  `h25` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'สถานะ',
  `h26` date NOT NULL COMMENT 'วันที่สร้าง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='test2';

--
-- Dumping data for table `tb_test2`
--

INSERT INTO `tb_test2` (`table_name_id`, `h1`, `h2_1`, `h2_2`, `h3`, `h4`, `h5`, `h6`, `h7`, `h8`, `h9`, `h10`, `h11`, `h12`, `h13`, `h14`, `h15`, `h16`, `h17`, `h18`, `h19`, `h20`, `h21`, `h22`, `h23`, `h24`, `h25`, `h26`) VALUES
(1, '1', '', 'เร่งด่วน-อนุมัติจาก อข.', 'I-63-G-POPXX.19.2000', 29792435.6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 29792435.6, 0, 29792435.6, 0, 0, 0, 0, 29792435.6, 'PREL BUDG // Z0', '2019-10-29'),
(2, '1.1', '', 'ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', 'I-63-G-POPXX.19.2100', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(3, '1.1.1', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟจ.อย.', 'I-63-G-AYYGS.19.2101', 448500, 0, 448500, 448500, 0, 0, 0, 0, 0, 0, 0, 448500, 448500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-07'),
(4, '1.1.2', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟฟ.รสต', 'I-63-G-RSTGS.19.2102', 92500, 0, 92500, 92500, 0, 0, 0, 0, 0, 0, 0, 92500, 92500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-07'),
(5, '1.1.3', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟจ.สบ', 'I-63-G-SBIGS.19.2103', 128460, 0, 128460, 128460, 0, 0, 0, 0, 0, 0, 0, 128460, 128460, 0, 0, 0, 0, 0, 0, 0, 0, 'TECO BUDG // F1', '2020-01-13'),
(6, '1.1.4', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟอ.ลก', 'I-63-G-LLAGS.19.2104', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 0, 161655, 'REL  BUDG // B2', '2020-01-13'),
(7, '1.1.5', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟฟหกง', 'I-63-G-BHKGS.19.2105', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 161565, 90, 'REL  BUDG // B2', '2020-01-13'),
(8, '1.1.6', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟส.มห', 'I-63-G-MKLGS.19.2106', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 0, 161655, 'REL  BUDG // B2', '2020-01-13'),
(9, '1.1.7', '03', 'กล้องวีดีโอพร้อมอุปกรณ์ฯที่ กอก.ก.1', 'I-63-G-AMDTR.19.2107', 107700, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 107700, 0, 107700, 0, 0, 0, 0, 107700, 'REL  BUDG // B2', '2020-01-29'),
(10, '1.1.8', '02', 'จัดซื้อตู้นิรภัยให้ กฟอ.ท่าเรือ', 'I-63-G-TREGS.19.2108', 17664, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17664, 0, 17664, 0, 0, 0, 0, 17664, 'REL  BUDG // B2', '2020-01-31'),
(11, '1.1.9', '03', 'ซื้อเครื่องนับธบัตร,ตู้นิรภัย กฟจ.ปท.', 'I-63-G-PTIGS.19.2109', 71356, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 71356, 0, 71356, 0, 0, 0, 0, 71356, 'REL  BUDG // B2', '2020-02-04'),
(12, '1.1.10', '03', 'เครืองฉายภาพ LCD Projector ที่ กวว.ก.1', 'I-63-G-CAPSO.19.2110', 40000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40000, 0, 40000, 0, 0, 0, 0, 40000, 'REL  BUDG // B2', '2020-02-04'),
(13, '', '', 'รวม 1.1 I-63-G-POPXX.19.2100 ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', '', 1391145, 0, 669460, 669460, 0, 0, 0, 0, 0, 0, 0, 669460, 669460, 721685, 0, 721685, 0, 0, 0, 161565, 560120, '', '0000-00-00'),
(14, '1.2', '', 'ครุภัณฑ์สื่อสาร', 'I-63-G-POPXX.19.2200', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(15, '1.2.1', '02', 'ระบบเครื่องเสียงห้องประชุมชั้น4 กฟก.1', 'I-63-G-CSDOC.19.2201', 399600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 399600, 0, 399600, 0, 0, 0, 0, 399600, 'REL  BUDG // B2', '2020-01-07'),
(16, '1.2.2', '02', 'ระบบสื่อสารที่ห้องสื่อสารที่ กฟจ.สบ.', 'I-63-G-SBIGS.19.2202', 100578, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-08'),
(17, '', '', 'รวม 1.2 I-63-G-POPXX.19.2200 ครุภัณฑ์สื่อสาร', '', 500178, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 100578, 100578, 399600, 0, 399600, 0, 0, 0, 0, 399600, '', '0000-00-00'),
(18, '1.3', '', 'เครื่องมือเครื่องใช้, คลังพัสดุ', 'I-63-G-POPXX.19.2300', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(19, '1.3.1', '04', 'เครืองวัดค่าความต้านทานดินให้ กฟฟ.', 'I-63-G-EAPST.19.2301', 208000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 208000, 0, 208000, 0, 0, 0, 222560, 14560, 'REL  BUDG // B2', '2020-01-08'),
(20, '1.3.2', '02', 'จัดซื้อล้อวัดระยะทางให้ กฟจ.ปจ.', 'I-63-G-PBICS.19.2302', 9159, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9159, 9158.88, 9159, 0, 0, 9158.88, 0, 0.12, 'REL  BUDG // B2', '2020-01-08'),
(21, '1.3.3', '02', 'เครื่องวัดค่าเพาเวอร์แฟคเตอร์ที่กฟอ.คล', 'I-63-G-KLGCS.19.2303', 40000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40000, 0, 40000, 40000, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-08'),
(22, '1.3.4', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟย.ดอนพุด', 'I-63-G-TREOM.19.2304', 59500, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-09'),
(23, '1.3.5', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.ท่าเรือ', 'I-63-G-TREOM.19.2305', 59500, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-10'),
(24, '1.3.6', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟส.ผักไห่', 'I-63-G-PHIOM.19.2306', 170000, 0, 170000, 170000, 0, 0, 0, 0, 0, 0, 0, 170000, 170000, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-10'),
(25, '1.3.7', '', 'ยกเลิก', 'I-63-G-DPTOM.19.2304', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // F1', '2020-01-10'),
(26, '1.3.8', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.บปอ.', 'I-63-G-BINOM.19.2307', 42000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42000, 0, 42000, 0, 0, 0, 0, 42000, 'REL  BUDG // B2', '2020-01-10'),
(27, '1.3.9', '03', 'เดรื่องมือฯ กฟจ.อย.', 'I-63-G-AYYME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-13'),
(28, '1.3.10', '03', 'เดรื่องมือฯ กฟจ.อท.', 'I-63-G-ATGME.19.2308', 70000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70000, 0, 70000, 0, 0, 0, 0, 70000, 'REL  BUDG // B2', '2020-01-13'),
(29, '1.3.11', '03', 'เดรื่องมือฯ กฟจ.สบ.', 'I-63-G-SBIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 17000, 0, 'REL  BUDG // B2', '2020-01-13'),
(30, '1.3.12', '03', 'เดรื่องมือฯ กฟอ.นงค.', 'I-63-G-NOKME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-13'),
(31, '1.3.13', '03', 'เดรื่องมือฯ กฟจ.ปจ.', 'I-63-G-PBIME.19.2308', 70000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70000, 0, 70000, 0, 0, 0, 0, 70000, 'REL  BUDG // B2', '2020-01-14'),
(32, '1.3.14', '03', 'เดรื่องมือฯ กฟอ.ศม.', 'I-63-G-SPOME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(33, '1.3.15', '03', 'เดรื่องมือฯ กฟจ.นย.', 'I-63-G-NNKME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(34, '1.3.16', '03', 'เดรื่องมือฯ กฟจ.ปท.', 'I-63-G-PTIME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(35, '1.3.17', '03', 'เดรื่องมือฯ กฟอ.ลลก.', 'I-63-G-LLOME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(36, '1.3.18', '03', 'เดรื่องมือฯ กฟอ.อป.', 'I-63-G-APTME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(37, '1.3.19', '03', 'เดรื่องมือฯ กฟฟ.รสต.', 'I-63-G-RSTME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(38, '1.3.20', '03', 'เดรื่องมือฯ กฟอ.คล.', 'I-63-G-KLGME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(39, '1.3.21', '03', 'เดรื่องมือฯ กฟอ.สน.', 'I-63-G-SENME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(40, '1.3.22', '03', 'เดรื่องมือฯ กฟอ.พพบ.', 'I-63-G-PPTME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 49000, 0, 'REL  BUDG // B2', '2020-01-14'),
(41, '1.3.23', '03', 'เดรื่องมือฯ กฟอ.ทรอ.', 'I-63-G-TREME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(42, '1.3.24', '03', 'เดรื่องมือฯ กฟอ.กบบ.', 'I-63-G-KBRME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(43, '1.3.25', '03', 'เดรื่องมือฯ กฟอ.ธญ.', 'I-63-G-TYIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(44, '1.3.26', '03', 'เดรื่องมือฯ กฟอ.บปอ.', 'I-63-G-BINME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(45, '1.3.27', '03', 'เดรื่องมือฯ กฟฟ.ปนอ.', 'I-63-G-PNIME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(46, '1.3.28', '03', 'เดรื่องมือฯ กฟอ.กคย.', 'I-63-G-KKIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(47, '1.3.29', '03', 'เดรื่องมือฯ กฟจ.สก.', 'I-63-G-SKEME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(48, '1.3.30', '03', 'เครื่องมือฯ กฟฟ.ปท.2', 'I-63-G-PTBME.19.2308', 61000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 61000, 0, 61000, 0, 0, 0, 0, 61000, 'REL  BUDG // B2', '2020-01-14'),
(49, '1.3.31', '03', 'เดรื่องมือฯ กฟอ.วน.', 'I-63-G-WNIME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(50, '1.3.32', '03', 'เดรื่องมือฯ กฟอ.ลก.', 'I-63-G-LLAME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(51, '1.3.33', '03', 'เดรื่องมือฯ กฟอ.หกง.', 'I-63-G-BHKME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(52, '1.3.34', '03', 'เดรื่องมือฯ กฟส.สคก.', 'I-63-G-SKOCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 27000, 0, 'REL  BUDG // B2', '2020-01-14'),
(53, '1.3.35', '03', 'เดรื่องมือฯ กฟส.นสอ.', 'I-63-G-NNSCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-14'),
(54, '1.3.36', '03', 'เดรื่องมือฯ กฟส.ผห.', 'I-63-G-PHICM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-14'),
(55, '1.3.37', '03', 'เดรื่องมือฯ กฟส.อ.อท.', 'I-63-G-UTHCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-14'),
(56, '1.3.38', '03', 'เดรื่องมือฯ กฟส.บปห.', 'I-63-G-BGHCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(57, '1.3.39', '03', 'เดรื่องมือฯ กฟส.ลบล.', 'I-63-G-LLKCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(58, '1.3.40', '03', 'เดรื่องมือฯ กฟส.นล.', 'I-63-G-NLGCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(59, '1.3.41', '03', 'เดรื่องมือฯ กฟส.วศ.', 'I-63-G-WCNCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(60, '1.3.42', '03', 'เดรื่องมือฯ กฟส.พท.', 'I-63-G-PTGCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(61, '1.3.43', '03', 'เดรื่องมือฯ กฟส.ปม.', 'I-63-G-PMKCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(62, '1.3.44', '03', 'เดรื่องมือฯ กฟส.นด.', 'I-63-G-NADCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(63, '1.3.45', '03', 'เดรื่องมือฯ กฟส.บน.', 'I-63-G-BNACM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(64, '1.3.46', '03', 'เดรื่องมือฯ กฟส.อร.', 'I-63-G-OKKCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(65, '1.3.47', '03', 'เดรื่องมือฯ กฟส.วฒ.', 'I-63-G-WTNCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(66, '1.3.48', '03', 'เดรื่องมือฯ กฟส.วนย.', 'I-63-G-WNNCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(67, '1.3.49', '03', 'เดรื่องมือฯ กฟส.บส.', 'I-63-G-BSGCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(68, '1.3.50', '03', 'เดรื่องมือฯ กฟส.วด.', 'I-63-G-WDGCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(69, '1.3.51', '03', 'เดรื่องมือฯ กฟส.มห.', 'I-63-G-MKLCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-16'),
(70, '1.3.52', '03', 'เดรื่องมือฯ กฟส.ปจค.', 'I-63-G-PCMCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-16'),
(71, '1.3.53', '03', 'เดรื่องมือฯ กฟย.ภาชี', 'I-63-G-NLGCM.19.2310', 55000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55000, 0, 55000, 0, 0, 0, 0, 55000, 'REL  BUDG // B2', '2020-01-16'),
(72, '1.3.54', '03', 'เดรื่องมือฯ กฟย.มหาราช,กฟย.บ้านแพรก', 'I-63-G-BGHCM.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 0, 46000, 'REL  BUDG // B2', '2020-01-16'),
(73, '1.3.55', '03', 'เดรื่องมือฯ กฟย.ไชโย', 'I-63-G-ATGME.19.2310', 66000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 66000, 0, 66000, 0, 0, 0, 0, 66000, 'REL  BUDG // B2', '2020-01-16'),
(74, '1.3.56', '03', 'เดรื่องมือฯ กฟย.สามโก้', 'I-63-G-WCNCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(75, '1.3.57', '03', 'เดรื่องมือฯ กฟย.แสวงหา', 'I-63-G-PTGCM.19.2310', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-16'),
(76, '1.3.58', '03', 'เดรื่องมือฯ กฟย.เสาไห้,กฟย.หนองแซง', 'I-63-G-SBIME.19.2310', 72000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 72000, 0, 72000, 0, 0, 0, 0, 72000, 'REL  BUDG // B2', '2020-01-16'),
(77, '1.3.59', '03', 'เดรื่องมือฯ กฟย.ปากพลี', 'I-63-G-NNKME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(78, '1.3.60', '03', 'เดรื่องมือฯ กฟย.ตาพระยา,กฟย.โคกสูง', 'I-63-G-APTME.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 23000, 23000, 'REL  BUDG // B2', '2020-01-16'),
(79, '1.3.61', '03', 'เดรื่องมือฯ กฟย.คลองหาด', 'I-63-G-WTNCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(80, '1.3.62', '03', 'เดรื่องมือฯ กฟย.บางบาล,บางซ้าย', 'I-63-G-SENME.19.2310', 78000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 78000, 0, 78000, 0, 0, 0, 0, 78000, 'REL  BUDG // B2', '2020-01-16'),
(81, '1.3.63', '03', 'เดรื่องมือฯ กฟย.บางไทร', 'I-63-G-LLKCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(82, '1.3.64', '03', 'เดรื่องมือฯ กฟย.หนองโดน', 'I-63-G-PPTME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(83, '1.3.65', '03', 'เดรื่องมือฯ กฟย.บ้านหมอ,กฟย.ดอนพุด', 'I-63-G-TREME.19.2310', 132000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 132000, 0, 132000, 0, 0, 0, 0, 132000, 'REL  BUDG // B2', '2020-01-16'),
(84, '1.3.66', '03', 'เดรื่องมือฯ กฟย.วังตะเคียน', 'I-63-G-KBRME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(85, '1.3.67', '03', 'เดรื่องมือฯ กฟย.วังม่วง,กฟย.ซับสนุ่น', 'I-63-G-MKLCM.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 0, 46000, 'REL  BUDG // B2', '2020-01-16'),
(86, '1.3.68', '03', 'เดรื่องมือฯ กฟย.เขาฉกรรณ์', 'I-63-G-SKEME.19.2310', 61000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 61000, 0, 61000, 0, 0, 0, 0, 61000, 'REL  BUDG // B2', '2020-01-16'),
(87, '1.3.69', '03', 'เดรื่องมือฯ กฟย.วังสมบูรณ์', 'I-63-G-WNNCM.19.2310', 67000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 67000, 0, 67000, 0, 0, 0, 0, 67000, 'REL  BUDG // B2', '2020-01-16'),
(88, '1.3.70', '03', 'เดรื่องมือฯ กฟย.ศรีมโหสถ,กฟย.ท่าตูม', 'I-63-G-SPOME.19.2310', 84000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 84000, 0, 84000, 0, 0, 0, 0, 84000, 'REL  BUDG // B2', '2020-01-16'),
(89, '', '', 'รวม 1.3 I-63-G-POPXX.19.2300 เครื่องมือเครื่องใช้, คลังพัสดุ', '', 2806159, 0, 289000, 289000, 0, 0, 0, 0, 0, 0, 0, 289000, 289000, 2517159, 9158.88, 2517159, 40000, 0, 9158.88, 338560, 2129440.12, '', '0000-00-00'),
(90, '1.4', '', 'คอมพิวเตอร์', 'I-63-G-POPXX.19.2400', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(91, '1.5', '', 'ยานพาหนะ', 'I-63-G-POPXX.19.2500', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(92, '1.6', '', 'ที่ดิน, ปรับปรุงที่ดิน', 'I-63-G-POPXX.19.2600', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(93, '1.7', '', 'สิ่งก่อสร้าง', 'I-63-G-POPXX.19.2700', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(94, '1.8', '', 'ต่อเติม, ปรับปรุง', 'I-63-G-POPXX.19.2800', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(95, '1.8.1', '06', 'ปป.ผนังภายนอก อาคาร1ด้านหน้า กฟก.1', 'I-63-G-CAPCW.19.2801', 458600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 458600, 0, 458600, 0, 0, 0, 0, 458600, 'REL  BUDG // B2', '2020-01-07'),
(96, '', '', 'รวม 1.8 I-63-G-POPXX.19.2800 ต่อเติม, ปรับปรุง', '', 458600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 458600, 0, 458600, 0, 0, 0, 0, 458600, '', '0000-00-00'),
(97, '1.9', '', 'ขยายเขต', 'I-63-G-POPXX.19.2900', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(98, '1.9.1', '06', 'กส.ระบจำหน่ายติดตั้งหม้อแปลงฯกฟฟ.บกด.', 'I-63-G-PTBGS.19.2901', 51482.4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51482.4, 0, 51482.4, 0, 0, 0, 0, 51482.4, 'REL  BUDG NSCH NTUP // C1', '2020-01-07'),
(99, '', '', 'รวม 1.9 I-63-G-POPXX.19.2900 ขยายเขต', '', 51482.4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51482.4, 0, 51482.4, 0, 0, 0, 0, 51482.4, '', '0000-00-00'),
(100, '', '', 'รวม 1 I-63-G-POPXX.19.2000 เร่งด่วน-อนุมัติจาก อข.', '', 35000000, 0, 1059038, 1059038, 0, 0, 0, 0, 0, 0, 0, 1059038, 1059038, 33940962, 9158.88, 33940962, 40000, 0, 9158.88, 500125, 33391678.12, '', '0000-00-00'),
(101, '', '', 'รวมทั้งสิ้น', '', 35000000, 0, 1059038, 1059038, 0, 0, 0, 0, 0, 0, 0, 1059038, 1059038, 33940962, 9158.88, 33940962, 40000, 0, 9158.88, 500125, 33391678.12, '', '0000-00-00');

-- --------------------------------------------------------

--
-- Table structure for table `tb_testttt555`
--

CREATE TABLE `tb_testttt555` (
  `table_name_id` int(11) NOT NULL COMMENT 'primary_key',
  `h1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ลำดับที่',
  `h2_1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'เลขที่รายการ',
  `h2_2` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ชื่อรายการ',
  `h3` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'WBS',
  `h4` double NOT NULL COMMENT 'วงเงินงบประมาณปัจจุบัน',
  `h5` double NOT NULL COMMENT 'รวมจ่ายจริงถึงสิ้นปีก่อนหน้า',
  `h6` double NOT NULL COMMENT 'รวมจ่ายจริงปีปัจจุบัน',
  `h7` double NOT NULL COMMENT 'รวมจ่ายจริง',
  `h8` double NOT NULL COMMENT 'เงินล่วงหน้าปีก่อนหน้า',
  `h9` double NOT NULL COMMENT 'เงินประกันปีก่อนหน้า',
  `h10` double NOT NULL COMMENT 'เงินล่วงหน้าปีปัจจุบัน',
  `h11` double NOT NULL COMMENT 'เงินประกันปีปัจจุบัน',
  `h12` double NOT NULL COMMENT 'เงินล่วงหน้าคงเหลือ',
  `h13` double NOT NULL COMMENT 'เงินประกันค้างจ่าย',
  `h14` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้นปีก่อนหน้า',
  `h15` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้นปีปัจจุบัน',
  `h16` double NOT NULL COMMENT 'รวมจ่ายทั้งสิ้น',
  `h17` double NOT NULL COMMENT 'งบประมาณหักรวมจ่ายทั้งสั้น',
  `h18` double NOT NULL COMMENT 'PO หัก รวมจ่ายจริง PO',
  `h19` double NOT NULL COMMENT 'งบประมาณหักรวมจ่ายจริง',
  `h20` double NOT NULL COMMENT 'IR-คงเหลือ',
  `h21` double NOT NULL COMMENT 'GR-คงเหลือ',
  `h22` double NOT NULL COMMENT 'PO-คงเหลือ',
  `h23` double NOT NULL COMMENT 'PR-คงเหลือ',
  `h24` double NOT NULL COMMENT 'วงเงินคงเหลือยังไม่ดำเนินการ',
  `h25` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'สถานะ',
  `h26` date NOT NULL COMMENT 'วันที่สร้าง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='testttt555';

--
-- Dumping data for table `tb_testttt555`
--

INSERT INTO `tb_testttt555` (`table_name_id`, `h1`, `h2_1`, `h2_2`, `h3`, `h4`, `h5`, `h6`, `h7`, `h8`, `h9`, `h10`, `h11`, `h12`, `h13`, `h14`, `h15`, `h16`, `h17`, `h18`, `h19`, `h20`, `h21`, `h22`, `h23`, `h24`, `h25`, `h26`) VALUES
(1, '1', '', 'เร่งด่วน-อนุมัติจาก อข.', 'I-63-G-POPXX.19.2000', 29792435.6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 29792435.6, 0, 29792435.6, 0, 0, 0, 0, 29792435.6, 'PREL BUDG // Z0', '2019-10-29'),
(2, '1.1', '', 'ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', 'I-63-G-POPXX.19.2100', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(3, '1.1.1', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟจ.อย.', 'I-63-G-AYYGS.19.2101', 448500, 0, 448500, 448500, 0, 0, 0, 0, 0, 0, 0, 448500, 448500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-07'),
(4, '1.1.2', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟฟ.รสต', 'I-63-G-RSTGS.19.2102', 92500, 0, 92500, 92500, 0, 0, 0, 0, 0, 0, 0, 92500, 92500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-07'),
(5, '1.1.3', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟจ.สบ', 'I-63-G-SBIGS.19.2103', 128460, 0, 128460, 128460, 0, 0, 0, 0, 0, 0, 0, 128460, 128460, 0, 0, 0, 0, 0, 0, 0, 0, 'TECO BUDG // F1', '2020-01-13'),
(6, '1.1.4', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟอ.ลก', 'I-63-G-LLAGS.19.2104', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 0, 161655, 'REL  BUDG // B2', '2020-01-13'),
(7, '1.1.5', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟฟหกง', 'I-63-G-BHKGS.19.2105', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 161565, 90, 'REL  BUDG // B2', '2020-01-13'),
(8, '1.1.6', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟส.มห', 'I-63-G-MKLGS.19.2106', 161655, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 161655, 0, 161655, 0, 0, 0, 0, 161655, 'REL  BUDG // B2', '2020-01-13'),
(9, '1.1.7', '03', 'กล้องวีดีโอพร้อมอุปกรณ์ฯที่ กอก.ก.1', 'I-63-G-AMDTR.19.2107', 107700, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 107700, 0, 107700, 0, 0, 0, 0, 107700, 'REL  BUDG // B2', '2020-01-29'),
(10, '1.1.8', '02', 'จัดซื้อตู้นิรภัยให้ กฟอ.ท่าเรือ', 'I-63-G-TREGS.19.2108', 17664, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17664, 0, 17664, 0, 0, 0, 0, 17664, 'REL  BUDG // B2', '2020-01-31'),
(11, '1.1.9', '03', 'ซื้อเครื่องนับธบัตร,ตู้นิรภัย กฟจ.ปท.', 'I-63-G-PTIGS.19.2109', 71356, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 71356, 0, 71356, 0, 0, 0, 0, 71356, 'REL  BUDG // B2', '2020-02-04'),
(12, '1.1.10', '03', 'เครืองฉายภาพ LCD Projector ที่ กวว.ก.1', 'I-63-G-CAPSO.19.2110', 40000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40000, 0, 40000, 0, 0, 0, 0, 40000, 'REL  BUDG // B2', '2020-02-04'),
(13, '', '', 'รวม 1.1 I-63-G-POPXX.19.2100 ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', '', 1391145, 0, 669460, 669460, 0, 0, 0, 0, 0, 0, 0, 669460, 669460, 721685, 0, 721685, 0, 0, 0, 161565, 560120, '', '0000-00-00'),
(14, '1.2', '', 'ครุภัณฑ์สื่อสาร', 'I-63-G-POPXX.19.2200', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(15, '1.2.1', '02', 'ระบบเครื่องเสียงห้องประชุมชั้น4 กฟก.1', 'I-63-G-CSDOC.19.2201', 399600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 399600, 0, 399600, 0, 0, 0, 0, 399600, 'REL  BUDG // B2', '2020-01-07'),
(16, '1.2.2', '02', 'ระบบสื่อสารที่ห้องสื่อสารที่ กฟจ.สบ.', 'I-63-G-SBIGS.19.2202', 100578, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-08'),
(17, '', '', 'รวม 1.2 I-63-G-POPXX.19.2200 ครุภัณฑ์สื่อสาร', '', 500178, 0, 100578, 100578, 0, 0, 0, 0, 0, 0, 0, 100578, 100578, 399600, 0, 399600, 0, 0, 0, 0, 399600, '', '0000-00-00'),
(18, '1.3', '', 'เครื่องมือเครื่องใช้, คลังพัสดุ', 'I-63-G-POPXX.19.2300', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(19, '1.3.1', '04', 'เครืองวัดค่าความต้านทานดินให้ กฟฟ.', 'I-63-G-EAPST.19.2301', 208000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 208000, 0, 208000, 0, 0, 0, 222560, 14560, 'REL  BUDG // B2', '2020-01-08'),
(20, '1.3.2', '02', 'จัดซื้อล้อวัดระยะทางให้ กฟจ.ปจ.', 'I-63-G-PBICS.19.2302', 9159, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9159, 9158.88, 9159, 0, 0, 9158.88, 0, 0.12, 'REL  BUDG // B2', '2020-01-08'),
(21, '1.3.3', '02', 'เครื่องวัดค่าเพาเวอร์แฟคเตอร์ที่กฟอ.คล', 'I-63-G-KLGCS.19.2303', 40000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40000, 0, 40000, 40000, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-08'),
(22, '1.3.4', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟย.ดอนพุด', 'I-63-G-TREOM.19.2304', 59500, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-09'),
(23, '1.3.5', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.ท่าเรือ', 'I-63-G-TREOM.19.2305', 59500, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 59500, 59500, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-10'),
(24, '1.3.6', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟส.ผักไห่', 'I-63-G-PHIOM.19.2306', 170000, 0, 170000, 170000, 0, 0, 0, 0, 0, 0, 0, 170000, 170000, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // B2', '2020-01-10'),
(25, '1.3.7', '', 'ยกเลิก', 'I-63-G-DPTOM.19.2304', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'REL  BUDG // F1', '2020-01-10'),
(26, '1.3.8', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.บปอ.', 'I-63-G-BINOM.19.2307', 42000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42000, 0, 42000, 0, 0, 0, 0, 42000, 'REL  BUDG // B2', '2020-01-10'),
(27, '1.3.9', '03', 'เดรื่องมือฯ กฟจ.อย.', 'I-63-G-AYYME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-13'),
(28, '1.3.10', '03', 'เดรื่องมือฯ กฟจ.อท.', 'I-63-G-ATGME.19.2308', 70000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70000, 0, 70000, 0, 0, 0, 0, 70000, 'REL  BUDG // B2', '2020-01-13'),
(29, '1.3.11', '03', 'เดรื่องมือฯ กฟจ.สบ.', 'I-63-G-SBIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 17000, 0, 'REL  BUDG // B2', '2020-01-13'),
(30, '1.3.12', '03', 'เดรื่องมือฯ กฟอ.นงค.', 'I-63-G-NOKME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-13'),
(31, '1.3.13', '03', 'เดรื่องมือฯ กฟจ.ปจ.', 'I-63-G-PBIME.19.2308', 70000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70000, 0, 70000, 0, 0, 0, 0, 70000, 'REL  BUDG // B2', '2020-01-14'),
(32, '1.3.14', '03', 'เดรื่องมือฯ กฟอ.ศม.', 'I-63-G-SPOME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(33, '1.3.15', '03', 'เดรื่องมือฯ กฟจ.นย.', 'I-63-G-NNKME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(34, '1.3.16', '03', 'เดรื่องมือฯ กฟจ.ปท.', 'I-63-G-PTIME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(35, '1.3.17', '03', 'เดรื่องมือฯ กฟอ.ลลก.', 'I-63-G-LLOME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(36, '1.3.18', '03', 'เดรื่องมือฯ กฟอ.อป.', 'I-63-G-APTME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(37, '1.3.19', '03', 'เดรื่องมือฯ กฟฟ.รสต.', 'I-63-G-RSTME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(38, '1.3.20', '03', 'เดรื่องมือฯ กฟอ.คล.', 'I-63-G-KLGME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(39, '1.3.21', '03', 'เดรื่องมือฯ กฟอ.สน.', 'I-63-G-SENME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(40, '1.3.22', '03', 'เดรื่องมือฯ กฟอ.พพบ.', 'I-63-G-PPTME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 49000, 0, 'REL  BUDG // B2', '2020-01-14'),
(41, '1.3.23', '03', 'เดรื่องมือฯ กฟอ.ทรอ.', 'I-63-G-TREME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(42, '1.3.24', '03', 'เดรื่องมือฯ กฟอ.กบบ.', 'I-63-G-KBRME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(43, '1.3.25', '03', 'เดรื่องมือฯ กฟอ.ธญ.', 'I-63-G-TYIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(44, '1.3.26', '03', 'เดรื่องมือฯ กฟอ.บปอ.', 'I-63-G-BINME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(45, '1.3.27', '03', 'เดรื่องมือฯ กฟฟ.ปนอ.', 'I-63-G-PNIME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(46, '1.3.28', '03', 'เดรื่องมือฯ กฟอ.กคย.', 'I-63-G-KKIME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(47, '1.3.29', '03', 'เดรื่องมือฯ กฟจ.สก.', 'I-63-G-SKEME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(48, '1.3.30', '03', 'เครื่องมือฯ กฟฟ.ปท.2', 'I-63-G-PTBME.19.2308', 61000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 61000, 0, 61000, 0, 0, 0, 0, 61000, 'REL  BUDG // B2', '2020-01-14'),
(49, '1.3.31', '03', 'เดรื่องมือฯ กฟอ.วน.', 'I-63-G-WNIME.19.2308', 38000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38000, 0, 38000, 0, 0, 0, 0, 38000, 'REL  BUDG // B2', '2020-01-14'),
(50, '1.3.32', '03', 'เดรื่องมือฯ กฟอ.ลก.', 'I-63-G-LLAME.19.2308', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-14'),
(51, '1.3.33', '03', 'เดรื่องมือฯ กฟอ.หกง.', 'I-63-G-BHKME.19.2308', 17000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17000, 0, 17000, 0, 0, 0, 0, 17000, 'REL  BUDG // B2', '2020-01-14'),
(52, '1.3.34', '03', 'เดรื่องมือฯ กฟส.สคก.', 'I-63-G-SKOCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 27000, 0, 'REL  BUDG // B2', '2020-01-14'),
(53, '1.3.35', '03', 'เดรื่องมือฯ กฟส.นสอ.', 'I-63-G-NNSCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-14'),
(54, '1.3.36', '03', 'เดรื่องมือฯ กฟส.ผห.', 'I-63-G-PHICM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-14'),
(55, '1.3.37', '03', 'เดรื่องมือฯ กฟส.อ.อท.', 'I-63-G-UTHCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-14'),
(56, '1.3.38', '03', 'เดรื่องมือฯ กฟส.บปห.', 'I-63-G-BGHCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(57, '1.3.39', '03', 'เดรื่องมือฯ กฟส.ลบล.', 'I-63-G-LLKCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(58, '1.3.40', '03', 'เดรื่องมือฯ กฟส.นล.', 'I-63-G-NLGCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(59, '1.3.41', '03', 'เดรื่องมือฯ กฟส.วศ.', 'I-63-G-WCNCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(60, '1.3.42', '03', 'เดรื่องมือฯ กฟส.พท.', 'I-63-G-PTGCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(61, '1.3.43', '03', 'เดรื่องมือฯ กฟส.ปม.', 'I-63-G-PMKCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(62, '1.3.44', '03', 'เดรื่องมือฯ กฟส.นด.', 'I-63-G-NADCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(63, '1.3.45', '03', 'เดรื่องมือฯ กฟส.บน.', 'I-63-G-BNACM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(64, '1.3.46', '03', 'เดรื่องมือฯ กฟส.อร.', 'I-63-G-OKKCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(65, '1.3.47', '03', 'เดรื่องมือฯ กฟส.วฒ.', 'I-63-G-WTNCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(66, '1.3.48', '03', 'เดรื่องมือฯ กฟส.วนย.', 'I-63-G-WNNCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(67, '1.3.49', '03', 'เดรื่องมือฯ กฟส.บส.', 'I-63-G-BSGCM.19.2309', 18000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18000, 0, 18000, 0, 0, 0, 0, 18000, 'REL  BUDG // B2', '2020-01-15'),
(68, '1.3.50', '03', 'เดรื่องมือฯ กฟส.วด.', 'I-63-G-WDGCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-15'),
(69, '1.3.51', '03', 'เดรื่องมือฯ กฟส.มห.', 'I-63-G-MKLCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-16'),
(70, '1.3.52', '03', 'เดรื่องมือฯ กฟส.ปจค.', 'I-63-G-PCMCM.19.2309', 27000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27000, 0, 27000, 0, 0, 0, 0, 27000, 'REL  BUDG // B2', '2020-01-16'),
(71, '1.3.53', '03', 'เดรื่องมือฯ กฟย.ภาชี', 'I-63-G-NLGCM.19.2310', 55000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55000, 0, 55000, 0, 0, 0, 0, 55000, 'REL  BUDG // B2', '2020-01-16'),
(72, '1.3.54', '03', 'เดรื่องมือฯ กฟย.มหาราช,กฟย.บ้านแพรก', 'I-63-G-BGHCM.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 0, 46000, 'REL  BUDG // B2', '2020-01-16'),
(73, '1.3.55', '03', 'เดรื่องมือฯ กฟย.ไชโย', 'I-63-G-ATGME.19.2310', 66000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 66000, 0, 66000, 0, 0, 0, 0, 66000, 'REL  BUDG // B2', '2020-01-16'),
(74, '1.3.56', '03', 'เดรื่องมือฯ กฟย.สามโก้', 'I-63-G-WCNCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(75, '1.3.57', '03', 'เดรื่องมือฯ กฟย.แสวงหา', 'I-63-G-PTGCM.19.2310', 49000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49000, 0, 49000, 0, 0, 0, 0, 49000, 'REL  BUDG // B2', '2020-01-16'),
(76, '1.3.58', '03', 'เดรื่องมือฯ กฟย.เสาไห้,กฟย.หนองแซง', 'I-63-G-SBIME.19.2310', 72000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 72000, 0, 72000, 0, 0, 0, 0, 72000, 'REL  BUDG // B2', '2020-01-16'),
(77, '1.3.59', '03', 'เดรื่องมือฯ กฟย.ปากพลี', 'I-63-G-NNKME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(78, '1.3.60', '03', 'เดรื่องมือฯ กฟย.ตาพระยา,กฟย.โคกสูง', 'I-63-G-APTME.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 23000, 23000, 'REL  BUDG // B2', '2020-01-16'),
(79, '1.3.61', '03', 'เดรื่องมือฯ กฟย.คลองหาด', 'I-63-G-WTNCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(80, '1.3.62', '03', 'เดรื่องมือฯ กฟย.บางบาล,บางซ้าย', 'I-63-G-SENME.19.2310', 78000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 78000, 0, 78000, 0, 0, 0, 0, 78000, 'REL  BUDG // B2', '2020-01-16'),
(81, '1.3.63', '03', 'เดรื่องมือฯ กฟย.บางไทร', 'I-63-G-LLKCM.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(82, '1.3.64', '03', 'เดรื่องมือฯ กฟย.หนองโดน', 'I-63-G-PPTME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(83, '1.3.65', '03', 'เดรื่องมือฯ กฟย.บ้านหมอ,กฟย.ดอนพุด', 'I-63-G-TREME.19.2310', 132000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 132000, 0, 132000, 0, 0, 0, 0, 132000, 'REL  BUDG // B2', '2020-01-16'),
(84, '1.3.66', '03', 'เดรื่องมือฯ กฟย.วังตะเคียน', 'I-63-G-KBRME.19.2310', 23000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23000, 0, 23000, 0, 0, 0, 0, 23000, 'REL  BUDG // B2', '2020-01-16'),
(85, '1.3.67', '03', 'เดรื่องมือฯ กฟย.วังม่วง,กฟย.ซับสนุ่น', 'I-63-G-MKLCM.19.2310', 46000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46000, 0, 46000, 0, 0, 0, 0, 46000, 'REL  BUDG // B2', '2020-01-16'),
(86, '1.3.68', '03', 'เดรื่องมือฯ กฟย.เขาฉกรรณ์', 'I-63-G-SKEME.19.2310', 61000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 61000, 0, 61000, 0, 0, 0, 0, 61000, 'REL  BUDG // B2', '2020-01-16'),
(87, '1.3.69', '03', 'เดรื่องมือฯ กฟย.วังสมบูรณ์', 'I-63-G-WNNCM.19.2310', 67000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 67000, 0, 67000, 0, 0, 0, 0, 67000, 'REL  BUDG // B2', '2020-01-16'),
(88, '1.3.70', '03', 'เดรื่องมือฯ กฟย.ศรีมโหสถ,กฟย.ท่าตูม', 'I-63-G-SPOME.19.2310', 84000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 84000, 0, 84000, 0, 0, 0, 0, 84000, 'REL  BUDG // B2', '2020-01-16'),
(89, '', '', 'รวม 1.3 I-63-G-POPXX.19.2300 เครื่องมือเครื่องใช้, คลังพัสดุ', '', 2806159, 0, 289000, 289000, 0, 0, 0, 0, 0, 0, 0, 289000, 289000, 2517159, 9158.88, 2517159, 40000, 0, 9158.88, 338560, 2129440.12, '', '0000-00-00'),
(90, '1.4', '', 'คอมพิวเตอร์', 'I-63-G-POPXX.19.2400', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(91, '1.5', '', 'ยานพาหนะ', 'I-63-G-POPXX.19.2500', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(92, '1.6', '', 'ที่ดิน, ปรับปรุงที่ดิน', 'I-63-G-POPXX.19.2600', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(93, '1.7', '', 'สิ่งก่อสร้าง', 'I-63-G-POPXX.19.2700', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CRTD // Z0', '2019-10-29'),
(94, '1.8', '', 'ต่อเติม, ปรับปรุง', 'I-63-G-POPXX.19.2800', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(95, '1.8.1', '06', 'ปป.ผนังภายนอก อาคาร1ด้านหน้า กฟก.1', 'I-63-G-CAPCW.19.2801', 458600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 458600, 0, 458600, 0, 0, 0, 0, 458600, 'REL  BUDG // B2', '2020-01-07'),
(96, '', '', 'รวม 1.8 I-63-G-POPXX.19.2800 ต่อเติม, ปรับปรุง', '', 458600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 458600, 0, 458600, 0, 0, 0, 0, 458600, '', '0000-00-00'),
(97, '1.9', '', 'ขยายเขต', 'I-63-G-POPXX.19.2900', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'PREL BUDG // Z0', '2019-10-29'),
(98, '1.9.1', '06', 'กส.ระบจำหน่ายติดตั้งหม้อแปลงฯกฟฟ.บกด.', 'I-63-G-PTBGS.19.2901', 51482.4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51482.4, 0, 51482.4, 0, 0, 0, 0, 51482.4, 'REL  BUDG NSCH NTUP // C1', '2020-01-07'),
(99, '', '', 'รวม 1.9 I-63-G-POPXX.19.2900 ขยายเขต', '', 51482.4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51482.4, 0, 51482.4, 0, 0, 0, 0, 51482.4, '', '0000-00-00'),
(100, '', '', 'รวม 1 I-63-G-POPXX.19.2000 เร่งด่วน-อนุมัติจาก อข.', '', 35000000, 0, 1059038, 1059038, 0, 0, 0, 0, 0, 0, 0, 1059038, 1059038, 33940962, 9158.88, 33940962, 40000, 0, 9158.88, 500125, 33391678.12, '', '0000-00-00'),
(101, '', '', 'รวมทั้งสิ้น', '', 35000000, 0, 1059038, 1059038, 0, 0, 0, 0, 0, 0, 0, 1059038, 1059038, 33940962, 9158.88, 33940962, 40000, 0, 9158.88, 500125, 33391678.12, '', '0000-00-00');

-- --------------------------------------------------------

--
-- Table structure for table `template_tb`
--

CREATE TABLE `template_tb` (
  `template_id` int(11) NOT NULL,
  `task_user_id` int(11) NOT NULL,
  `colum_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `datatype` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `template_tb`
--

INSERT INTO `template_tb` (`template_id`, `task_user_id`, `colum_name`, `datatype`) VALUES
(1, 1, 'test01', 'int'),
(2, 1, 'test02', 'varchar'),
(3, 2, 'test03', 'float');

-- --------------------------------------------------------

--
-- Table structure for table `test_json`
--

CREATE TABLE `test_json` (
  `id` int(11) NOT NULL,
  `transaction_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `item_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `descc` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `variant_code` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `cost` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `test_json`
--

INSERT INTO `test_json` (`id`, `transaction_number`, `date`, `item_number`, `descc`, `variant_code`, `quantity`, `cost`) VALUES
(1, 'AB-0001', '2018-08-01', '0101010', 'This is a', '002', 2, 2000),
(2, 'AB-0001', '2018-08-01', '0101010', 'This is a', '004', 3, 2000),
(3, 'AB-0001', '2018-08-01', '0101010', 'This is a', '005', 4, 2000),
(4, 'AB-0001', '2018-08-01', '0101010', 'This is a', '006', 5, 2000),
(5, 'AB-0001', '2018-08-01', '0101010', 'This is a', '008', 1, 2000),
(6, 'AB-0002', '2018-08-02', '0101010', 'This is b', '013', 2, 2000),
(7, 'AB-0002', '2018-08-02', '0101010', 'This is b', '020', 3, 2500),
(8, 'AB-0002', '2018-08-02', '0101010', 'This is b', '022', 4, 2500),
(9, 'AB-0003', '2018-08-03', '0101010', 'This is c', '007', 1, 2500),
(10, 'AB-0003', '2018-08-03', '0101010', 'This is c', '015', 7, 2500);

-- --------------------------------------------------------

--
-- Table structure for table `token_line`
--

CREATE TABLE `token_line` (
  `id` int(11) NOT NULL,
  `token` varchar(255) NOT NULL,
  `task_id` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `namegroup_line` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `token_line`
--

INSERT INTO `token_line` (`id`, `token`, `task_id`, `id_user`, `namegroup_line`) VALUES
(1, 'asggwsdsdgsdf', 4, 3, 'test');

-- --------------------------------------------------------

--
-- Table structure for table `userpea`
--

CREATE TABLE `userpea` (
  `id_pea` int(11) NOT NULL,
  `username` int(10) NOT NULL,
  `name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Department` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Position` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `levelpea` varchar(100) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `userpea`
--

INSERT INTO `userpea` (`id_pea`, `username`, `name`, `lastname`, `Department`, `Position`, `levelpea`) VALUES
(1, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5'),
(2, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5'),
(3, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `alert`
--
ALTER TABLE `alert`
  ADD PRIMARY KEY (`alert_id`);

--
-- Indexes for table `data_dic_ref`
--
ALTER TABLE `data_dic_ref`
  ADD PRIMARY KEY (`data_dic_ref_id`);

--
-- Indexes for table `empolyee`
--
ALTER TABLE `empolyee`
  ADD PRIMARY KEY (`id_user`);

--
-- Indexes for table `task_user`
--
ALTER TABLE `task_user`
  ADD PRIMARY KEY (`task_user_id`);

--
-- Indexes for table `tb_test2`
--
ALTER TABLE `tb_test2`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `tb_testttt555`
--
ALTER TABLE `tb_testttt555`
  ADD PRIMARY KEY (`table_name_id`),
  ADD UNIQUE KEY `table_name_id` (`table_name_id`);

--
-- Indexes for table `template_tb`
--
ALTER TABLE `template_tb`
  ADD PRIMARY KEY (`template_id`);

--
-- Indexes for table `test_json`
--
ALTER TABLE `test_json`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `token_line`
--
ALTER TABLE `token_line`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `userpea`
--
ALTER TABLE `userpea`
  ADD PRIMARY KEY (`id_pea`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `alert`
--
ALTER TABLE `alert`
  MODIFY `alert_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `data_dic_ref`
--
ALTER TABLE `data_dic_ref`
  MODIFY `data_dic_ref_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `empolyee`
--
ALTER TABLE `empolyee`
  MODIFY `id_user` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `task_user`
--
ALTER TABLE `task_user`
  MODIFY `task_user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK', AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tb_test2`
--
ALTER TABLE `tb_test2`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'primary_key', AUTO_INCREMENT=102;

--
-- AUTO_INCREMENT for table `tb_testttt555`
--
ALTER TABLE `tb_testttt555`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'primary_key', AUTO_INCREMENT=102;

--
-- AUTO_INCREMENT for table `template_tb`
--
ALTER TABLE `template_tb`
  MODIFY `template_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `test_json`
--
ALTER TABLE `test_json`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `token_line`
--
ALTER TABLE `token_line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `userpea`
--
ALTER TABLE `userpea`
  MODIFY `id_pea` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
