-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 27 ก.พ. 2020 เมื่อ 08:39 AM
-- เวอร์ชันของเซิร์ฟเวอร์: 10.4.11-MariaDB
-- PHP Version: 7.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test_import_excel`
--

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `alert`
--

CREATE TABLE `alert` (
  `alert_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `token_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `table_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `alert_date` date NOT NULL,
  `alert_time` time NOT NULL,
  `line_group_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `file_alert_path` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `record_count` int(11) NOT NULL,
  `status` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `data_dic_ref`
--

CREATE TABLE `data_dic_ref` (
  `data_dic_ref_id` int(11) NOT NULL,
  `field_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `column_order` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tb_ref_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `empolyee`
--

CREATE TABLE `empolyee` (
  `id_user` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `leveltest` int(1) NOT NULL,
  `img_em` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `empolyee`
--

INSERT INTO `empolyee` (`id_user`, `username`, `password`, `name`, `leveltest`, `img_em`) VALUES
(1, 'user', '25f9e794323b453885f5181f1b624d0b', 'ประทาน โพธิ์ภู่', 0, '08bd1.png'),
(2, 'admin', '25f9e794323b453885f5181f1b624d0b', 'แกน', 1, 'maxresdefault.jpg'),
(3, '505972', 'fa717c1cae7a7b36f7518a5dfbb4b214', 'สุภัทรา', 0, '');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `task_user`
--

CREATE TABLE `task_user` (
  `task_user_id` int(11) NOT NULL COMMENT 'PK',
  `user_id` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ไอดีผู้ใช้',
  `task_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='ตารางเก็บความสัมพันระหว่างงานกับผู้ใช้';

--
-- dump ตาราง `task_user`
--

INSERT INTO `task_user` (`task_user_id`, `user_id`, `task_name`) VALUES
(1, '3', 'tb_092563'),
(2, '3', 'testfrgdhgdhgh'),
(3, '3', 'testfield_count'),
(4, '3', 'งบเร่งด่วนมกรา');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `tb_092563`
--

CREATE TABLE `tb_092563` (
  `table_name_id` int(11) NOT NULL,
  `h1` varchar(255) NOT NULL,
  `h2_1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `h2_2` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `h3` varchar(255) NOT NULL,
  `h4` varchar(255) NOT NULL,
  `h5` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `tb_092563`
--

INSERT INTO `tb_092563` (`table_name_id`, `h1`, `h2_1`, `h2_2`, `h3`, `h4`, `h5`) VALUES
(1, '1', '', 'เร่งด่วน-กลุ่มธุรกิจจำหน่ายและบริการ', 'PREL BUDG AVAC // Z0', 'I-62-G-POPXX.19.2000', '381291.18'),
(2, '1.1', '', 'ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', 'PREL BUDG AVAC // A0', 'I-62-G-POPXX.19.2100', '0'),
(3, '1.1.1', '02', 'จัดซื้อกล้องถ่ายรูปฯกบล.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CTSCM.19.2101', '37084.11'),
(4, '1.1.2', '02', 'จัดซื้อกล้องถ่ายรูปฯกฟส.ผักไห่', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PHIGS.19.2102', '35121.5'),
(5, '1.1.3', '02', 'จัดซื้อกล้องถ่ายรูปฯกฟอ.ลำลูกกา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-LLAGS.19.2103', '32616.82'),
(6, '1.1.4', '02', 'ติดตั้งเครื่องปรับอากาศที่ กฟส.ป่าโมก', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PMKGS.19.2104', '63831.78'),
(7, '1.1.5', '02', 'ติดตั้งเครื่องปรับอากาศที่กฟส.วิหารแดง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-WDGEA.19.2105', '56500'),
(8, '1.1.6', '02', 'ติดตั้งเครื่องปรับอากาศที่ กฟส.อ.นาดี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-NADEA.19.2106', '53457.94'),
(9, '1.1.7', '02', 'จัดซื้อเก้าอี้ทำงาน ให้ ฝวบ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EASGS.19.2107', '4663.55'),
(10, '1.1.8', '02', 'ซื้อโต๊ะบาร์ห้องประชุมอาคาร2ชั้น4 ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AMDGS.19.2108', '6149.53'),
(11, '1.1.9', '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.อท.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-ATGGS.19.2109', '45600'),
(12, '1.1.10', '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟส.นาดี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NADGS.19.2110', '45600'),
(13, '1.1.11', '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.ปท.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PTIGS.19.2111', '33000'),
(14, '1.1.12', '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.อป.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.2112', '21308.41'),
(15, '1.1.13', '02', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ให้กฟยซับสนุ่น', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KKIGS.19.2113', '24000'),
(16, '1.1.14', '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟอ.คล.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KLGGS.19.2114', '51450'),
(17, '1.1.15', '02', 'จัดซื้อเก้าอี้ทำงาน ให้ นบท.11', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-XXXGS.19.2115', '4663.55'),
(18, '1.1.16', '02', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟย.วังม่วง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KKIGS.19.2116', '70000'),
(19, '1.1.17', '02', 'จัดซื้อเครื่องชั่งน้ำหนัก ให้ กฟอ.พพบ.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PPTGS.19.2117', '43000'),
(20, '1.1.18', '02', 'จัดซื้อพัดดูดอากาศ ให้ กฟส.วิหารแดง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WDGGS.19.2118', '6000'),
(21, '1.1.19', '02', 'ซื้อครุภัณฑ์สำนักงาน ให้ กฟจ.ปทุมธานี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PTIGS.19.2119', '79000'),
(22, '1.1.20', '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.บางไทร', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-LLKGS.19.2120', '29600'),
(23, '1.1.21', '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.ภาชี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NLGGS.19.2121', '41800'),
(24, '1.1.22', '02', 'ซื้อโต๊ะบาร์ห้องประชุมอาคาร2ชั้น4 ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AMDGS.19.2122', '6149.53'),
(25, '1.1.23', '02', 'จัดซื้อเครื่องทำน้ำเย็น กบล.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CTSCT.19.2123', '7242.99'),
(26, '1.1.24', '02', 'โต๊ะประชุมและเก้าอี้ที่ให้ กฟย.ภาชี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NLGGS.19.2124', '30800'),
(27, '1.1.25', '02', 'จัดซื้อครุภัณฑฯให้กฟย.บ้านหมอ,ดอนพุด', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-TREGS.19.2125', '78504.67'),
(28, '1.1.26', '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.แสวงหา', 'REL  BUDG AVAC SETC // B2', 'I-62-G-PTGGS.19.2126', '30100'),
(29, '1.1.27', '03', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟอ.ท่าเรือ', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-TREGS.19.2127', '46000'),
(30, '1.1.28', '02', 'จัดซื้อเครื่องทำน้ำเย็น กฟย.ภาชี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NLGGS.19.2128', '3800'),
(31, '1.1.29', '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟฟ.รสต.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-RSTGS.19.2129', '30000'),
(32, '1.1.30', '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟฟ.รสต.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-RSTGS.19.2130', '32600'),
(33, '1.1.31', '03', 'จัดซื้อ LED TV ให้ กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-POPGS.19.2131', '26158.88'),
(34, '1.1.32', '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.ไชโย', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-ATGGS.19.2132', '71700'),
(35, '1.1.33', '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.เสาไห้', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SBIGS.19.2133', '45000'),
(36, '1.1.34', '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.สามโก้', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WCNGS.19.2134', '19600'),
(37, '1.1.35', '03', 'จัดซื้อโทรทัศน์ LED ให้ กฟฟ.รังสิต', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-RSTGS.19.2135', '34570.09'),
(38, '1.1.36', '03', 'จัดซื้อครุภัณฑ์สำนักงานให้กฟจ.อยุธยา', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.2136', '72000'),
(39, '1.1.37', '03', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟอ.วังน้อย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-WNIGS.19.2137', '97000'),
(40, '1.1.38', '03', 'จัดซื้อนาฬิกายาม ให้  กฟจ.อยุธยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AYYGS.19.2138', '6500'),
(41, '1.1.39', '03', 'จัดซื้อโต๊ะทำงานพร้อมเก้าอี้ให้กฟจ.อย.', 'REL  BUDG AVAC // B2', 'I-62-G-AYYGS.19.2139', '16300'),
(42, '1.1.40', '03', 'จัดซื้อโต๊ะหมู่บูชาที่ กฟจ.ปราจีนบุรี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PBIGS.19.2140', '6074.77'),
(43, '1.1.41', '03', 'จัดซื้อโทรทัศน์  ให้ กฟอ.บางปะอิน', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-BINGS.19.2141', '10271.03'),
(44, '1.1.42', '03', 'จัดซื้อเครื่องทำน้ำเย็นกฟอ.ลาดหลุมแก้ว', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-LLOGS.19.2142', '3448.6'),
(45, '1.1.43', '03', 'จัดซื้อเครื่องดูดฝุ่น ให้ กฟอ.ลลก.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-LLOGS.19.2143', '14859.81'),
(46, '1.1.44', '03', 'จัดซื้อตู้เก็บเอกสาร ที่ กฟอ.บางปะอิน', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BINGS.19.2144', '16000'),
(47, '1.1.45', '03', 'ซื้อโต๊ะและเก้าอี้รับรองแขกให้กฟจ.ปจ.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PBIGS.19.2145', '19626.15'),
(48, '1.1.46', '03', 'จัดซื้อเครื่องปรับอากาศ ที่ กฟย.ภาชี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-NLGGS.19.2146', '105420.56'),
(49, '1.1.47', '08', 'ซื้อครุณฑ์สำนักงานสถานีอัดประจุไฟฟ้าก1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-EAPEA.19.2147', '383050'),
(50, '1.1.48', '04', 'จัดซื้อนาฬิกายามให้สฟ.ฯ10 แห่ง กปบ.ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-OPDOP.19.2148', '115000'),
(51, '1.1.49', '04', 'จัดซื้อนาฬิกายามให้สฟ.ฯ10แห่ง  กปบ.ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-OPDOP.19.2149', '115000'),
(52, '1.1.50', '05', 'จัดซื้อเครื่องทำน้ำเย็นที่ กฟย.เสาไห้', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SBIGS.19.2150', '4383.18'),
(53, '1.1.51', '05', 'จัดซื้อเก้าอี้ประชุมฯกฟย.เสาไห้', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SBIGS.19.2151', '32400'),
(54, '1.1.52', '05', 'เครื่องทำน้ำเย็นน้ำร้อนที่กฟยเขาฉกรรจ์', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SKEGS.19.2152', '4579.44'),
(55, '1.1.53', '05', 'ซื้อโต๊ะทำงานพร้อมเก้าอี้ให้กฟยบางบาล', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2153', '55000'),
(56, '1.1.54', '05', 'ซื้อโต๊ะประชุมและเก้าอี้ให้กฟย.ศรีมโหส', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SPOGS.19.2154', '51500'),
(57, '1.1.55', '05', '0จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟอ.ธญ.', 'CRTD AVAC // A0', 'I-62-G-TYIGS.19.2155', '0'),
(58, '1.1.56', '', 'จัดซื้อตู้นิรภัยให้ แก้ กฟจ.อย.', 'REL  BUDG AVAC // B2', 'I-62-G-AYYGS.19.2156', '25300'),
(59, '1.1.57', '05', 'ติดตั้งม่านปรับแสงที่ กฟอ.หนองแค', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-NOKCA.19.2157', '99000'),
(60, '1.1.58', '05', 'ซื้อตู้เก็บของแบบแบ่งเป็นช่อง กฟอ.วน.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WNIGS.19.2158', '26000'),
(61, '1.1.59', '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.2159', '144000'),
(62, '1.1.60', '05', 'จัดซื้อโต๊ะระชุม,เก้าอี้ให้กฟย.คลองหาด', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WTNGS.19.2160', '38500'),
(63, '1.1.61', '05', '0จัดซื้อโต๊ะประชุมและเก้าอี้ กฟยท่าตูม', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SPOGS.19.2161', '40400'),
(64, '1.1.62', '05', 'จัดซื้อโต๊ะระชุม,เก้าอี้ให้กฟย.บางบาล', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2162', '40400'),
(65, '1.1.63', '05', 'จัดซื้อโต๊ะประชุมเก้าอี้ให้กฟย.บางซ้าย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2163', '28000'),
(66, '1.1.64', '05', 'โต๊ะ,เก้าอี้ศูนย์ พ.ร.บ.ให้กฟย.บางซ้าย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2164', '7500'),
(67, '1.1.65', '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.2165', '174900'),
(68, '1.1.66', '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.2166', '408200'),
(69, '1.1.67', '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟอ.วน.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WNIGS.19.2167', '81200'),
(70, '1.1.68', '08', '8จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.ปจ.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PBIGS.19.2168', '211500'),
(71, '1.1.69', '05', 'จัดซื้อโต๊ะประชุมเก้าอี้กฟย.เขาฉกรรจ์', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SKEGS.19.2169', '35000'),
(72, '1.1.70', '06', 'จัดซื้อโต๊ะเก้าอี้ฯ ให้ กฟย.วังตะเคียน', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KBRGS.19.2170', '26644.86'),
(73, '1.1.71', '05', 'จัดซื้อเครื่องทำน้ำเย็น ให้ กฟย.ดอนพุด', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-TREGS.19.2171', '4710.28'),
(74, '1.1.72', '05', 'จัดซื้อเครื่องทำน้ำเย็น ให้ กฟย.บางบาล', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2172', '4579.44'),
(75, '1.1.73', '06', 'จัดซื้อโต๊ะเก้าอี้ฯ ให้ กฟย.โคกสูง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.2173', '38500'),
(76, '1.1.74', '09', 'โต๊ะประชุม,เก้าอี้ฯให้ กฟย.ตาพระยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.2174', '30900'),
(77, '1.1.75', '07', 'ตู้เก็บเอกสารโต๊ะทานอาหารฯกฟจ.สบ.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SBIGS.19.2175', '246000'),
(78, '1.1.76', '06', 'จัดซื้อเก้าอี้ทำงานให้ กบญ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ACTGS.19.2176', '10345.79'),
(79, '1.1.77', '08', 'เครื่องแสดงภาพ(โทรทัศน์)อาคาร2ชั้น4ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CSDCS.19.2177', '336000'),
(80, '1.1.78', '07', 'จัดซื้อเก้าอี้ ให้ อก.อก.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AMDGS.19.2178', '4663.55'),
(81, '1.1.79', '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟอ.บปอ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-BINGS.19.2179', '39205.61'),
(82, '1.1.80', '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟฟ.ปนอ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PNIGS.19.2180', '38691.6'),
(83, '1.1.81', '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟอ.อป.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.2181', '26915.89'),
(84, '1.1.82', '07', '8จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟจ.อย.', 'REL  BUDG AVAC // B2', 'I-62-G-AYYIC.19.2182', '15000'),
(85, '1.1.83', '08', '8จัดซื้อโต๊ะพร้อมเก้าอี้ทำงานให้ หผ.ซฟ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-POPGS.19.2183', '4300'),
(86, '1.1.84', '08', '2ติดตั้งบอร์ดผู้บิหาร ที่ กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCW.19.2184', '139400'),
(87, '1.1.85', '11', '6ซื้อพร้อมติดMontor Display ที่กฟก.1', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-CSDCE.19.2185', '1510000'),
(88, '1.1.86', '08', '8จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.อย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AYYGS.19.2186', '459600'),
(89, '1.1.87', '08', '7จัดซื้อเก้าอี้ทำงาน ให้ กบญ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ACTGS.19.2187', '9252.34'),
(90, '1.1.88', '10', '8จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟส.ลบล.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-LLKGS.19.2188', '43551.4'),
(91, '1.1.89', '09', '3ติดตั้งเครื่องปรับอากาศที่สถ.ECS ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EAPAE.19.2189', '39252.34'),
(92, '1.1.90', '08', '8จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.ธญ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-TYIGS.19.2190', '31000'),
(93, '1.1.91', '08', '8จัดซื้อเครื่องดูดฝ่นฯ กฟจ.ปจ.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PBIGS.19.2191', '21392.52'),
(94, '1.1.92', '08', '8จัดซื้อตู้เก็บเอกสาร,ตู้โชว์ กฟจ.ปจ.', 'REL  BUDG AVAC // B2', 'I-62-G-PBIGS.19.2192', '41120'),
(95, '1.1.93', '10', 'จัดซื้อโทรทัศน์ฯ ให้ กฟฟ.ปนอ.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PNIGS.19.2193', '17747.66'),
(96, '1.1.94', '09', '8จัดซื้อโต๊ะประชุม ให้ กฟส.ปจค.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PCMGS.19.2194', '30500'),
(97, '1.1.95', '09', 'จัดซื้อเครื่องทำน้ำเย็นให้ กฟย.บางซ้าย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SENGS.19.2195', '4579.44'),
(98, '1.1.96', '09', 'โต๊ะประชุและเก้าอี้ กฟย.วังสมบูรณ์', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WNNXX.19.2196', '38500'),
(99, '1.1.97', '09', 'ติดบม่านพร้อมชุดเพื่อใช้งานที่ กวว.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EAPGS.19.2197', '29990'),
(100, '1.1.98', '09', 'จัดซื้อเก้าอี้ประชุมที่ กบญ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ACTGS.19.2198', '22400'),
(101, '1.1.99', '09', 'จัดซื้อเก้าอี้ ให้ อข.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-XXXGS.19.2199', '12728.97'),
(102, '1.1.100', '09', 'จัดซื้อเก้าอี้ ให้ กม.ก.1', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-AMDLA.19.21AA', '25658.88'),
(103, '1.1.101', '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กฟย.ท่าตูม', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SPOGS.19.21AB', '18400'),
(104, '1.1.102', '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กฟสวิหารแดง', 'REL  BUDG AVAC // B2', 'I-62-G-WDGGS.19.21AC', '30000'),
(105, '1.1.103', '09', 'จัดซื้อโทรทัศน์ ให้  กฟอ.ลาดหลุมแก้ว', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-LLOCM.19.21AD', '13000'),
(106, '1.1.104', '10', 'จัดซื้อโต๊ะประชุมที่ กฟย.ปากพลี', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-NNKGS.19.21AE', '6074.77'),
(107, '1.1.105', '10', 'ติดตั้งม่านพร้อมชุดใช้งาน อาคาร1ชั้น3', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EAPGS.19.21AF', '29990'),
(108, '1.1.106', '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กวว.ก1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EAPGS.19.21AI', '16056.06'),
(109, '1.1.107', '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กบล.ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CTSGS.19.21AJ', '22000'),
(110, '1.1.108', '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.ทรอ.', 'REL  BUDG AVAC // B2', 'I-62-G-TREGS.19.21AK', '41800'),
(111, '1.1.109', '11', 'โต๊ะประชุมและเก้าอี้ที่ กฟอ.กบบ.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KBRGS.19.21AL', '158000'),
(112, '1.1.110', '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟส.วนย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WNNGS.19.21AM', '11400'),
(113, '1.1.111', '10', 'จัดซื้อตู้เหล็กฯ ที่ กฟอ.แก่งคอย', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KKIGS.19.21AN', '37800'),
(114, '1.1.112', '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.กคย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KKIGS.19.21AO', '18400'),
(115, '1.1.113', '10', 'จัดซื้อโต๊ะอาหารและเก้าอี้ที่ กฟจ.อย.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.21AP', '103800'),
(116, '1.1.114', '10', 'จัดซื้อโต๊ะประชุมและเก้าอี้ ที่ กฟจ.อย', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-AYYGS.19.21AQ', '108200'),
(117, '1.1.115', '10', 'จัดซื้อทำน้ำเย็น ที่ กฟอ.กบินทร์บุรี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KBRGS.19.21AR', '26355.14'),
(118, '1.1.116', '10', 'จัดซื้อตู้เก็บเอกสารฯที่ กฟอ.อป.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.21AS', '7383.18'),
(119, '1.1.117', '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.อป.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.21AT', '35327.1'),
(120, '1.1.118', '', 'ยกเลิก', 'REL  BUDG AVAC // B2', 'I-62-G-APTGS.19.21AU', '0'),
(121, '1.1.119', '10', 'จัดซื้อกล้องถ่ายฯ ให้ กฟจ.สระบุรี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SBIGS.19.21AU', '32700.93'),
(122, '1.1.120', '11', 'ชุดรับแขกที่สถานที่รับรองลูกค้า กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-XXXGS.19.21AV', '16327.1'),
(123, '1.1.121', '', 'ยกเลิก', 'REL  BUDG AVAC // F1', 'I-62-G-ACTUP.19.21AW', '0'),
(124, '1.1.122', '10', 'จัดซื้อโต๊ะและเก้าอี้แถ้วฯที่ กฟอ.อป.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-APTAP.19.21AX', '25514.03'),
(125, '1.1.123', '10', 'จัดซื้อตู้ล๊อกเกอร์ ให้ กฟส.บส.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BSGGS.19.21AY', '18400'),
(126, '1.1.124', '10', 'จัดซื้อเครื่องนับธนบัตร ให้ กฟส.สามโคก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SKOAF.19.21AZ', '30747.66'),
(127, '1.1.125', '10', 'จัดซื้อเก้าอี้ประชุมที่ กฟจ.สระแก้ว', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SKEGS.19.21BA', '40100'),
(128, '1.1.126', '10', 'จัดซื้อกล้องถ่ายฯ ให้ กฟฟ.ปตน.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PNICM.19.21BB', '30373.83'),
(129, '1.1.127', '10', 'จัดซื้อตู้เก็บเอกสารให้ กอก.ก.1', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-AMDLA.19.21BC', '9345.79'),
(130, '1.1.128', '10', 'จัดซื้อSmart TVให้ กบญ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ACTPU.19.21AW', '21682.24'),
(131, '1.1.129', '10', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.กบบ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KBRGS.19.21BD', '401300'),
(132, '1.1.130', '10', 'จัดซื้อตู้น้ำดื่มให้ กบญ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ACTGS.19.21BE', '7243.27'),
(133, '1.1.131', '11', 'จัดซื้อโต๊ะประชุมและเก้าอี้กฟย.หนองแซง', 'REL  BUDG AVAC // B2', 'I-62-G-SBIGS.19.21BF', '40400'),
(134, '1.1.132', '11', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟย.หนองโดน', 'REL  BUDG AVAC // B2', 'I-62-G-PPTGS.19.21BG', '68131'),
(135, '1.1.133', '11', 'จัดซื้อเก้าอี้ทำงานให้ กฟย.ตาพระยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTGS.19.21BH', '3700'),
(136, '1.1.134', '12', 'เครื่องปรับอากาศที่ กฟย.เขาฉกรรจ์', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SKEGS.19.21BI', '35514.02'),
(137, '', '', 'รวม 1.1 I-62-G-POPXX.19.2100 ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', '', '', '8503583.58'),
(138, '1.2', '', 'ครุภัณฑ์สื่อสาร', 'PREL BUDG AVAC // A0', 'I-62-G-POPXX.19.2200', '0'),
(139, '1.2.1', '02', 'ติดตั้งระบบแจ้งเตือนอัคคีภัยที่สฟอญ2ชค', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTOP.19.2201', '75000'),
(140, '1.2.2', '02', 'ระบบแจ้งเตือนอัคคีภัยที่สฟคลองสอง(ชค)', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-LLAOP.19.2202', '75000'),
(141, '1.2.3', '04', 'จัดซื้อแบตเตอรี่ระบบไฟฟ้าสำรองฯกปบ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-OPDDP.19.2203', '61200'),
(142, '1.2.4', '07', 'จัดซื้อแบตเตอรี่ระบบไฟฟ้าสำรอง กปบ.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-OPDDP.19.2204', '345600'),
(143, '1.2.5', '03', 'ระบบแจ้งเตือนอัคคีภัยที่สฟ.คลองหนึง.ชค', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-OPDDP.19.2205', '75000'),
(144, '1.2.6', '05', 'จัดซื้อเครื่องรับส่งวิทยุฯ ให้ กรส.ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2206', '452000'),
(145, '1.2.7', '', 'ยกเลิก', 'REL  BUDG AVAC // F1', 'I-62-G-KBRCS.19.2207', '0'),
(146, '1.2.8', '05', 'จัดซื้อชุดเครื่องเสียงฯ ให้ กฟอ.กบบ.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2207', '33000'),
(147, '1.2.9', '07', 'ติดตั้งระบบโทรทัศน์วงจรปิดที่ ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2208', '60000'),
(148, '1.2.10', '07', 'ระบบโทรทัศน์วงจรปิดโรงเก็บอุปกรณ์ ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2209', '60000'),
(149, '1.2.11', '', 'ยกเลิก', 'REL  BUDG AVAC // F1', 'I-62-G-LLOCS.19.2210', '0'),
(150, '1.2.12', '', 'ยกเลิก', 'REL  BUDG AVAC // B2', 'I-62-G-CSDGS.19.2212', '0'),
(151, '1.2.13', '06', 'จัดซื้อชุดเครื่องบันทึกโทรศัพท์ฯกฟฟรสต', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2213', '25000'),
(152, '1.2.14', '05', 'จัดซื้อชุดเครื่องเสียง กฟอ.ลาดหลุมแก้ว', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-CSDCS.19.2210', '33000'),
(153, '1.2.15', '07', 'ระบบโทรทัศน์วงจรปิดที่คลังพัสดุ กฟจ.อย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CSDCS.19.2211', '60000'),
(154, '', '', 'รวม 1.2 I-62-G-POPXX.19.2200 ครุภัณฑ์สื่อสาร', '', '', '1354800'),
(155, '1.3', '', 'เครื่องมือเครื่องใช้, คลังพัสดุ', 'PREL BUDG AVAC // B2', 'I-62-G-POPXX.19.2300', '0'),
(156, '1.3.1', '02', 'เครื่องมือตรวจสอบแรงดันฯ กฟฟ.ปท.2บกด.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PTBEA.19.2301', '95000'),
(157, '1.3.2', '02', 'เครื่องมือเครื่องใช้ฯ กฟจ.อยุธยา', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-AYYCT.19.2302', '48000'),
(158, '1.3.3', '02', 'เครื่องมือเครื่องใชฯ กฟจ.อ่างทอง', 'REL  BUDG AVAC // B2', 'I-62-G-ATGCT.19.2302', '17000'),
(159, '1.3.4', '02', 'เครื่องมือเครื่องใชฯ กฟจ.สระบุรี', 'TECO BUDG AVAC // D3', 'I-62-G-SBICT.19.2302', '49000'),
(160, '1.3.5', '02', 'เครื่องมือเครื่องใชฯ กฟอ.หนองแค', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NOKCT.19.2302', '49000'),
(161, '1.3.6', '02', 'เครื่องมือเครื่องใชฯ กฟฟ.หินกอง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-BHKCT.19.2302', '48000'),
(162, '1.3.7', '02', 'เครื่องมือเครื่องใชฯ กฟจ.ปราจีนบุรี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PBICT.19.2302', '17000'),
(163, '1.3.8', '02', 'เครื่องมือเครื่องใชฯ กฟอ.ศรีมหาโพธิ', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SPOCT.19.2302', '49000'),
(164, '1.3.9', '02', 'เครื่องมือเครื่องใชฯ กฟจ.นครนายก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NNKCT.19.2302', '17000'),
(165, '1.3.10', '02', 'เครื่องมือเครื่องใชฯ กฟจ.ปทุมธานี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PTICT.19.2302', '49000'),
(166, '1.3.11', '02', 'เครื่องมือเครื่องใชฯ กฟอ.ลาดหลุมแก้ว', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-LLOCT.19.2302', '48000'),
(167, '1.3.12', '02', 'เครื่องมือเครื่องใชฯ กฟอ.อรัญประเทศ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTCT.19.2302', '17000'),
(168, '1.3.13', '02', 'เครื่องมือเครื่องใชฯ กฟฟ.รังสิต', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-RSTCT.19.2302', '49000'),
(169, '1.3.14', '02', 'เครื่องมือเครื่องใชฯ กฟอ.คลองหลวง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KLGCT.19.2302', '48000'),
(170, '1.3.15', '02', 'เครื่องมือเครื่องใชฯ กฟอ.เสนา', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SENCT.19.2302', '49000'),
(171, '1.3.16', '02', 'เครื่องมือเครื่องใชฯ กฟอ.พระพุทธบาท', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PPTCT.19.2302', '17000'),
(172, '1.3.17', '02', 'เครื่องมือเครื่องใชฯ กฟอ.ท่าเรือ', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-TRECT.19.2302', '49000'),
(173, '1.3.18', '02', 'เครื่องมือเครื่องใชฯ กฟอ.กบินทร์บุรี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KBRCT.19.2302', '48000'),
(174, '1.3.19', '02', 'เครื่องมือเครื่องใชฯ กฟอ.ธัญบุรี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-TYICT.19.2302', '48000'),
(175, '1.3.20', '02', 'เครื่องมือเครื่องใชฯ กฟอ.บางปะอิน', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BINCT.19.2302', '49000'),
(176, '1.3.21', '02', 'เครื่องมือเครื่องใชกฟฟประตูน้ำพระอินทร', 'REL  BUDG AVAC SETC // B2', 'I-62-G-PNICT.19.2302', '17000'),
(177, '1.3.22', '02', 'เครื่องมือเครื่องใชฯ กฟอ.แก่งคอย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KKICT.19.2302', '48000'),
(178, '1.3.23', '02', 'เครื่องมือเครื่องใชฯ กฟจ.สระแก้ว', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SKECT.19.2302', '49000'),
(179, '1.3.24', '02', 'เครื่องมือเครื่องใชฯกฟอ.ปทุมธานี2(บกด)', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PTBCT.19.2302', '45000'),
(180, '1.3.25', '02', 'เครื่องมือเครื่องใชฯ กฟอ.วังน้อย', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WNICT.19.2302', '49000'),
(181, '1.3.26', '02', 'เครื่องมือเครื่องใชฯ กฟอ.ลำลูกกา', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-LLACT.19.2302', '17000'),
(182, '1.3.27', '02', 'เครื่องมือเครื่องใชฯ กฟย.ภาชี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NLGCT.19.2303', '17000'),
(183, '1.3.28', '02', 'เครื่องมือเครื่องใชกฟย.มหาราช,บ้านแพรก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BGHCT.19.2303', '98000'),
(184, '1.3.29', '02', 'เครื่องมือเครื่องใชฯ กฟย.ไชโย', 'REL  BUDG AVAC // B2', 'I-62-G-ATGCT.19.2303', '25000'),
(185, '1.3.30', '02', 'เครื่องมือเครื่องใชฯ กฟย.สามโก้', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WCNCT.19.2303', '49000'),
(186, '1.3.31', '02', 'เครื่องมือเครื่องใชฯ กฟย.แสวงหา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-PTGCT.19.2303', '21000'),
(187, '1.3.32', '02', 'เครื่องมือเครื่องใชฯกฟย.เสาไห้,หนองแซง', 'TECO BUDG ISBD AVAC // D3', 'I-62-G-SBICT.19.2303', '71600'),
(188, '1.3.33', '02', 'เครื่องมือเครื่องใชฯ กฟย.ปากพลี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NNKCT.19.2303', '49000'),
(189, '1.3.34', '', '', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-APTCT.19.2303', '98000'),
(190, '1.3.35', '02', 'เครื่องมือเครื่องใชฯ กฟย.คลองหาด', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WTNCT.19.2303', '49000'),
(191, '1.3.36', '02', 'เครื่องมือเครื่องใชฯกฟย.บางบาล,บางซ้าย', 'REL  BUDG AVAC SETC // B2', 'I-62-G-SENCT.19.2303', '85000'),
(192, '1.3.37', '02', 'เครื่องมือเครื่องใชฯ กฟย.บางไทร', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-LLKCT.19.2303', '49000'),
(193, '1.3.38', '02', 'เครื่องมือเครื่องใชฯกฟย.หนองโดน', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PPTCT.19.2303', '49000'),
(194, '1.3.39', '02', 'เครื่องมือเครื่องใชฯกฟย.บ้านหมอ,ดอนพุด', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-TRECT.19.2303', '50000'),
(195, '1.3.40', '02', 'เครื่องมือเครื่องใชฯกฟย.วังตะเคียน', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-KBRCT.19.2303', '48000'),
(196, '1.3.41', '02', 'เครื่องมือเครื่องใชกฟยวังม่วง,ซับสนุ่น', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-MKLCT.19.2303', '98000'),
(197, '1.3.42', '02', 'เครื่องมือเครื่องใชฯกฟย.เขาฉกรรณ์', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SKECT.19.2303', '30000'),
(198, '1.3.43', '02', 'เครื่องมือเครื่องใชฯกฟย.วังสมบูรณ์', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WNNCT.19.2303', '24000'),
(199, '1.3.44', '02', 'เครื่องมือเครื่องใชฯกฟยศรีมโหสถ,ท่าตูม', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SPOCT.19.2303', '77000'),
(200, '1.3.45', '02', 'เครื่องมือเครื่องใชฯกฟส.สามโคก', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SKOCT.19.2304', '49000'),
(201, '1.3.46', '02', 'เครื่องมือเครื่องใชฯกฟส.หนองเสือ', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NNSCT.19.2304', '49000'),
(202, '1.3.47', '02', 'เครื่องมือเครื่องใชฯกฟส.ผักไห่', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PHICT.19.2304', '49000'),
(203, '1.3.48', '02', 'เครื่องมือเครื่องใชฯกฟส.อุทัย', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-UTHCT.19.2304', '49000'),
(204, '1.3.49', '02', 'เครื่องมือเครื่องใชฯกฟส.บางปะหัน', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BGHCT.19.2304', '68000'),
(205, '1.3.50', '02', 'เครื่องมือเครื่องใชฯกฟส.ลาดบัวหลวง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-LLKCT.19.2304', '49000'),
(206, '1.3.51', '02', 'เครื่องมือเครื่องใชฯกฟส.นครหลวง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NLGCT.19.2304', '49000'),
(207, '1.3.52', '02', 'เครื่องมือเครื่องใชฯกฟส.วิเศษชัยชาย', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WCNCT.19.2304', '49000'),
(208, '1.3.53', '02', 'เครื่องมือเครื่องใชฯกฟส.โพธิ์ทอง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PTGCT.19.2304', '49000'),
(209, '1.3.54', '02', 'เครื่องมือเครื่องใชฯกฟส.ป่าโมก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PMKCT.19.2304', '49000'),
(210, '1.3.55', '02', 'เครื่องมือเครื่องใชฯกฟส.นาดี', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-NADCT.19.2304', '68000'),
(211, '1.3.56', '02', 'เครื่องมือเครื่องใชฯกฟส.บ้านนา', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BNACT.19.2304', '49000'),
(212, '1.3.57', '02', 'เครื่องมือเครื่องใชฯกฟส.องค์รักษ์', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-OKKCT.19.2304', '49000'),
(213, '1.3.58', '02', 'เครื่องมือเครื่องใชฯกฟส.วัฒนานคร', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WTNCT.19.2304', '49000'),
(214, '1.3.59', '02', 'เครื่องมือเครื่องใชฯกฟส.วังน้ำเย็น', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WNNCT.19.2304', '49000'),
(215, '1.3.60', '02', 'เครื่องมือเครื่องใชฯกฟส.บ้านสร้าง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-BSGCT.19.2304', '49000'),
(216, '1.3.61', '02', 'เครื่องมือเครื่องใชฯกฟส.วิหารแดง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WDGCT.19.2304', '49000'),
(217, '1.3.62', '02', 'เครื่องมือเครื่องใชฯกฟส.มวกเหล็ก', 'REL  BUDG AVAC // B2', 'I-62-G-MKLCT.19.2304', '68000'),
(218, '1.3.63', '02', 'เครื่องมือเครื่องใชฯกฟส.ประจันตคาม', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PCMCT.19.2304', '49000'),
(219, '1.3.64', '02', 'เครื่องตัดหญ้า ให้ กฟจ.อยุธยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-AYYGS.19.2305', '8130.84'),
(220, '1.3.65', '08', 'เครื่องมือตรวจสอบแรงดันฯให้ กวว.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-EAPEA.19.2306', '1373944'),
(221, '1.3.66', '10', 'เครื่องมือต่อสายลงดินแรงสูงฯให้ กวว.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-EAPEA.19.2307', '3840000'),
(222, '1.3.67', '10', 'เครื่องมือไม้ชักฟิวส์ฯให้ กวว.1', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-EAPEA.19.2308', '2886000'),
(223, '1.3.68', '05', 'เครื่องมือให้ กฟส.วิหารแดง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-WDGMA.19.2309', '20000'),
(224, '1.3.69', '07', 'ซื้อล้อวัดระยะทาง ให้ กฟอ.คลองหลวง', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-KLGCT.19.2310', '5000'),
(225, '1.3.70', '11', 'จัดซื้อเครื่องตัดหญ้าฯ กฟส.ประจันตคาม', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PCMGS.19.2311', '7429.9'),
(226, '', '', 'รวม 1.3 I-62-G-POPXX.19.2300 เครื่องมือเครื่องใช้, คลังพัสดุ', '', '', '11201104.74'),
(227, '1.4', '', 'คอมพิวเตอร์', 'PREL BUDG AVAC // A0', 'I-62-G-POPXX.19.2400', '0'),
(228, '1.4.1', '03', 'จัดซื้อเครื่องสำรองไฟUPSฯกรส.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CSDCS.19.2401', '84000'),
(229, '1.4.2', '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.สามโก้', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2402', '60373.83'),
(230, '1.4.3', '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.ภาชี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2403', '98971.96'),
(231, '1.4.4', '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.วังม่วง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2404', '118364.49'),
(232, '1.4.5', '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.เสาไห้', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2405', '73317.76'),
(233, '1.4.6', '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.ตาพระยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2406', '73317.76'),
(234, '1.4.7', '06', 'ซื้อตู้RACKระบบเครือข่ายให้กับกฟย.ก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-ITSIT.19.2407', '351360'),
(235, '1.4.8', '', 'ยกเลิก', 'REL  BUDG AVAC // B2', 'I-62-G-OPDOP.19.2408', '0'),
(236, '1.4.9', '12', 'ซื้อต้RACKพร้อมอุปกรณ์ที่ เขต กฟก.1', 'REL  BUDG AVAC // B2', 'I-62-G-ITSCN.19.2408', '125000'),
(237, '1.4.10', '11', 'ติดตั้งระบบเครือข่าย ให้ กรท.ก.1', 'REL  BUDG AVAC // B2', 'I-62-G-ITSCN.19.2409', '90560.75'),
(238, '1.4.11', '11', 'ติดตั้งระบบเครือข่าย ให้ กซข.ก.1', 'REL  BUDG AVAC // B2', 'I-62-G-ITSCN.19.2410', '92289.72'),
(239, '', '', 'รวม 1.4 I-62-G-POPXX.19.2400 คอมพิวเตอร์', '', '', '1167556.27'),
(240, '1.5', '', 'ยานพาหนะ', 'CRTD AVAC // A0', 'I-62-G-POPXX.19.2500', '0'),
(241, '1.6', '', 'ที่ดิน, ปรับปรุงที่ดิน', 'CRTD AVAC // A0', 'I-62-G-POPXX.19.2600', '0'),
(242, '1.7', '', 'สิ่งก่อสร้าง', 'CRTD AVAC // A0', 'I-62-G-POPXX.19.2700', '0'),
(243, '1.8', '', 'ต่อเติม, ปรับปรุง', 'PREL BUDG AVAC // A0', 'I-62-G-POPXX.19.2800', '0'),
(244, '1.8.1', '', 'ยกเลิก', 'REL  BUDG ISBD AVAC // F1', 'I-62-G-SPOCA.19.2801', '0'),
(245, '1.8.2', '03', ' กส.ลาน คสล. กฟอ.ศม.', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-SPOCA.19.2802', '829906.54'),
(246, '1.8.3', '03', 'ปป.เทลานคอนกรีตฯที่ กฟจ.ปจ.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-PBICA.19.2803', '623364.49'),
(247, '1.8.4', '03', 'กส.ลาน คสล.คลังพัสดุ กฟจ.สบ.', 'TECO BUDG ISBD AVAC SETC // D3', 'I-62-G-SBICA.19.2804', '445000'),
(248, '1.8.5', '03', 'กส.กั้นห้องภายในอาคารชั้น 3', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-APTCA.19.2805', '77400'),
(249, '1.8.6', '03', 'กส.ห้องน้ำผู้พิการฯที่ กฟอ.อรัญประเทศ', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTCA.19.2806', '72300'),
(250, '1.8.7', '06', 'ปป.ลาดแอสฟัลท์บิรเวณรอบหอพระ กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCA.19.2807', '465000'),
(251, '1.8.8', '06', 'กส.รั้วประตูลวดตาข่ายล้อมรอบคลังกฟจ.นย', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-NNKCA.19.2808', '327500'),
(252, '1.8.9', '06', 'กส.เทลานคอนกรีต กฟส.ลบล.', 'TECO BUDG ISBD AVAC SETC // F4', 'I-62-G-LLKCA.19.2809', '442388'),
(253, '1.8.10', '08', 'กส.ที่รับรองผู้ใช้ส.อัดประจุไฟฟ้า กวว.', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-EAPEA.19.2810', '467000'),
(254, '1.8.11', '06', 'กส.ห้องน้ำผู้พิการฯที่ กฟย.สามโก้', 'REL  BUDG AVAC SETC // B2', 'I-62-G-WCNCA.19.2811', '285000'),
(255, '1.8.12', '10', 'กส.รั้วคอนกรีตบล๊อกที่คลัง กฟจ.สบ.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-SBICA.19.2812', '729500'),
(256, '1.8.13', '05', 'กส.ป้ายชื่อ สนง.ที่รั้ว กฟส.ป่าโมก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-PMKCA.19.2813', '44750'),
(257, '1.8.14', '06', 'กส.ห้องน้ำคนพิเศษ ที่ กฟย.วังม่วง', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-MKLCA.19.2814', '88000'),
(258, '1.8.15', '07', 'ปป.ซุ้มหลังคาที่จอดรถยนต์ที่ กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCA.19.2815', '428060'),
(259, '1.8.16', '06', 'ปป.ภูมิทัศน์ด้านหน้าอาคาร 1 กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCA.19.2816', '205000'),
(260, '1.8.17', '06', 'ติดตั้งกระจกบริเวณข้างหอพระฯ ที กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCA.19.2817', '92000'),
(261, '1.8.18', '08', 'ปป.ผนังภายนอกอาคาร 1 ด้านทิศใต้ กฟก.1', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-CAPCA.19.2818', '394600'),
(262, '1.8.19', '08', 'กส.ประตูลวดตาข่าย บานเลื่อน ที่ กฟจ.สก', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-SKECA.19.2819', '33800'),
(263, '1.8.20', '09', '3ปป.ระบบส่องสว่างสถานีไฟฟ้า ก.1', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-EAPAE.19.2820', '25000'),
(264, '1.8.21', '', 'ยกเลิก', 'REL  BUDG AVAC // B2', 'I-62-G-CAPCW.19.2821', '0'),
(265, '1.8.22', '10', '1กส.ห้องน้ำผู้พิการ กฟย.ภาชี', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-NLGCN.19.2821', '75000'),
(266, '1.8.23', '09', '2ปป.ทางเท้าสาธารณะที่ กฟอ.กบบ.', 'TECO BUDG ISBD AVAC SETC // D2', 'I-62-G-KBRCN.19.2822', '23500'),
(267, '1.8.24', '08', '1กส.ห้องน้ำผู้พิการ ให้ กฟย.ตาพระยา', 'CLSD BUDG ISBD AVAC SETC // F4', 'I-62-G-APTCN.19.2823', '80000'),
(268, '1.8.25', '11', 'ปป.เวทีทำตู้ชั้นโชว์ฝ้าเพดานที่ กฟก.1', 'REL  BUDG AVAC // B2', 'I-62-G-CAPCA.19.2824', '449800'),
(269, '1.8.26', '10', 'กั้นห้องภายในอาคารโรงเก็บพัสดุฯ กฟจ.อป', 'CLSD BUDG AVAC SETC // F4', 'I-62-G-APTCN.19.2825', '9500'),
(270, '1.8.27', '12', 'ปป.พื้นที่ปฏิบัติงานตรงพื้นที่ กซข.ก.1', 'REL  BUDG AVAC // B2', 'I-62-G-POPGS.19.2826', '262700'),
(271, '1.8.28', '11', 'กส.ฐานอาคารสำเร็จรูปที่ กฟฟ.หกง.', 'REL  BUDG ISBD AVAC // B2', 'I-62-G-BHKCN.19.2827', '82800'),
(272, '1.8.29', '11', 'กส.ฐานอาคารสำเร็จรูปที่ กฟส.มวกเหล็ก', 'REL  BUDG AVAC // B2', 'I-62-G-MKLCN.19.2827', '82800'),
(273, '', '', 'รวม 1.8 I-62-G-POPXX.19.2800 ต่อเติม, ปรับปรุง', '', '', '7141669.03'),
(274, '1.9', '', 'ขยายเขต', 'PREL BUDG AVAC // A0', 'I-62-G-POPXX.19.2900', '23514.79'),
(275, '1.9.1', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL10)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2901', '16100'),
(276, '1.9.2', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(LLK09)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2902', '6900'),
(277, '1.9.3', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL04)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2903', '16800'),
(278, '1.9.4', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL05)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2904', '17000'),
(279, '1.9.5', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(LLK04)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2905', '6900'),
(280, '1.9.6', '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KQU05)', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-LLACT.19.2906', '6900'),
(281, '1.9.7', '10', 'ติดตั้งหม้อแปลงอาคารสำนักงานใหม่กฟจ.อย', 'REL  BUDG ISBD AVAC NTUP SETC // C1', 'I-62-G-AYYCT.19.2907', '4600'),
(282, '1.9.8', '08', 'ติตตั้งหม้อแปลงอาคารสำนักงาน กฟอ.กบบ.', 'CLSD BUDG ISBD AVAC NSCH NTUP SETC // F4', 'I-62-G-KBRCT.19.2908', '88248'),
(283, '1.9.9', '08', 'ติตตั้งหม้อแปลงอาคารสำนักงาน กฟจ.สบ.', 'CLSD BUDG ISBD AVAC NTUP SETC // F4', 'I-62-G-SBICT.19.2909', '63032.41'),
(284, '', '', 'รวม 1.9 I-62-G-POPXX.19.2900 ขยายเขต', '', '', '249995.2'),
(285, '', '', 'รวม 1 I-62-G-POPXX.19.2000 เร่งด่วน-กลุ่มธุรกิจจำหน่ายและบริการ', '', '', '30000000'),
(286, '', '', 'รวมทั้งสิ้น', '', '', '30000000');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `template_tb`
--

CREATE TABLE `template_tb` (
  `template_id` int(11) NOT NULL,
  `task_user_id` int(11) NOT NULL,
  `colum_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `datatype` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `template_tb`
--

INSERT INTO `template_tb` (`template_id`, `task_user_id`, `colum_name`, `datatype`) VALUES
(1, 1, 'ลำดับที่', 'varchar(255)'),
(2, 1, 'รายการ', 'varchar(255)'),
(3, 1, 'สถานะ', 'varchar(255)'),
(4, 1, 'WBS', 'varchar(255)'),
(5, 1, 'วงเงินงบประมาณปัจจุบัน', 'varchar(255)'),
(6, 2, 'ลำดับที่', 'varchar(255)'),
(7, 2, 'วันที่สร้าง', 'date'),
(8, 2, 'WBS', 'varchar(255)'),
(9, 2, 'วงเงินงบประมาณปัจจุบัน', 'double'),
(10, 2, 'รายการ', 'varchar(255)'),
(11, 3, 'field1', 'varchar(255)'),
(12, 3, 'field2', 'double'),
(13, 3, 'field3', 'double'),
(14, 4, 'ลำดับที่', 'varchar(255)'),
(15, 4, 'รายการ', 'varchar(255)'),
(16, 4, 'WBS', 'varchar(255)'),
(17, 4, 'วงเงินงบประมาณปัจจุบัน', 'double'),
(18, 3, 'fieldeasdd', 'date'),
(19, 3, 'fieldseecond', 'double');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `testfield_count`
--

CREATE TABLE `testfield_count` (
  `table_name_id` int(11) NOT NULL,
  `h1` varchar(255) NOT NULL,
  `h2` double NOT NULL,
  `h3` double NOT NULL,
  `h4` date NOT NULL,
  `h5` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `testfrgdhgdhgh`
--

CREATE TABLE `testfrgdhgdhgh` (
  `table_name_id` int(11) NOT NULL,
  `h1` varchar(255) NOT NULL,
  `h2` date NOT NULL,
  `h3` varchar(255) NOT NULL,
  `h4` double NOT NULL,
  `h5_1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `h5_2` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `testfrgdhgdhgh`
--

INSERT INTO `testfrgdhgdhgh` (`table_name_id`, `h1`, `h2`, `h3`, `h4`, `h5_1`, `h5_2`) VALUES
(1, '1', '2018-09-14', 'I-62-G-POPXX.19.2000', 381291.18, '', 'เร่งด่วน-กลุ่มธุรกิจจำหน่ายและบริการ'),
(2, '1.1', '2018-09-14', 'I-62-G-POPXX.19.2100', 0, '', 'ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ'),
(3, '1.1.1', '2019-01-03', 'I-62-G-CTSCM.19.2101', 37084.11, '02', 'จัดซื้อกล้องถ่ายรูปฯกบล.'),
(4, '1.1.2', '2019-01-03', 'I-62-G-PHIGS.19.2102', 35121.5, '02', 'จัดซื้อกล้องถ่ายรูปฯกฟส.ผักไห่'),
(5, '1.1.3', '2019-01-03', 'I-62-G-LLAGS.19.2103', 32616.82, '02', 'จัดซื้อกล้องถ่ายรูปฯกฟอ.ลำลูกกา'),
(6, '1.1.4', '2019-01-03', 'I-62-G-PMKGS.19.2104', 63831.78, '02', 'ติดตั้งเครื่องปรับอากาศที่ กฟส.ป่าโมก'),
(7, '1.1.5', '2019-01-04', 'I-62-G-WDGEA.19.2105', 56500, '02', 'ติดตั้งเครื่องปรับอากาศที่กฟส.วิหารแดง'),
(8, '1.1.6', '2019-01-04', 'I-62-G-NADEA.19.2106', 53457.94, '02', 'ติดตั้งเครื่องปรับอากาศที่ กฟส.อ.นาดี'),
(9, '1.1.7', '2019-01-21', 'I-62-G-EASGS.19.2107', 4663.55, '02', 'จัดซื้อเก้าอี้ทำงาน ให้ ฝวบ.ก.1'),
(10, '1.1.8', '2019-01-22', 'I-62-G-AMDGS.19.2108', 6149.53, '02', 'ซื้อโต๊ะบาร์ห้องประชุมอาคาร2ชั้น4 ก.1'),
(11, '1.1.9', '2019-01-25', 'I-62-G-ATGGS.19.2109', 45600, '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.อท.'),
(12, '1.1.10', '2019-01-25', 'I-62-G-NADGS.19.2110', 45600, '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟส.นาดี'),
(13, '1.1.11', '2019-01-25', 'I-62-G-PTIGS.19.2111', 33000, '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.ปท.'),
(14, '1.1.12', '2019-01-30', 'I-62-G-APTGS.19.2112', 21308.41, '02', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.อป.'),
(15, '1.1.13', '2019-01-30', 'I-62-G-KKIGS.19.2113', 24000, '02', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ให้กฟยซับสนุ่น'),
(16, '1.1.14', '2019-01-30', 'I-62-G-KLGGS.19.2114', 51450, '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟอ.คล.'),
(17, '1.1.15', '2019-01-30', 'I-62-G-XXXGS.19.2115', 4663.55, '02', 'จัดซื้อเก้าอี้ทำงาน ให้ นบท.11'),
(18, '1.1.16', '2019-01-30', 'I-62-G-KKIGS.19.2116', 70000, '02', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟย.วังม่วง'),
(19, '1.1.17', '2019-01-30', 'I-62-G-PPTGS.19.2117', 43000, '02', 'จัดซื้อเครื่องชั่งน้ำหนัก ให้ กฟอ.พพบ.'),
(20, '1.1.18', '2019-01-30', 'I-62-G-WDGGS.19.2118', 6000, '02', 'จัดซื้อพัดดูดอากาศ ให้ กฟส.วิหารแดง'),
(21, '1.1.19', '2019-01-31', 'I-62-G-PTIGS.19.2119', 79000, '02', 'ซื้อครุภัณฑ์สำนักงาน ให้ กฟจ.ปทุมธานี'),
(22, '1.1.20', '2019-01-31', 'I-62-G-LLKGS.19.2120', 29600, '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.บางไทร'),
(23, '1.1.21', '2019-01-31', 'I-62-G-NLGGS.19.2121', 41800, '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.ภาชี'),
(24, '1.1.22', '2019-01-31', 'I-62-G-AMDGS.19.2122', 6149.53, '02', 'ซื้อโต๊ะบาร์ห้องประชุมอาคาร2ชั้น4 ก.1'),
(25, '1.1.23', '2019-01-31', 'I-62-G-CTSCT.19.2123', 7242.99, '02', 'จัดซื้อเครื่องทำน้ำเย็น กบล.ก.1'),
(26, '1.1.24', '2019-02-01', 'I-62-G-NLGGS.19.2124', 30800, '02', 'โต๊ะประชุมและเก้าอี้ที่ให้ กฟย.ภาชี'),
(27, '1.1.25', '2019-02-01', 'I-62-G-TREGS.19.2125', 78504.67, '02', 'จัดซื้อครุภัณฑฯให้กฟย.บ้านหมอ,ดอนพุด'),
(28, '1.1.26', '2019-02-01', 'I-62-G-PTGGS.19.2126', 30100, '02', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.แสวงหา'),
(29, '1.1.27', '2019-02-01', 'I-62-G-TREGS.19.2127', 46000, '03', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟอ.ท่าเรือ'),
(30, '1.1.28', '2019-02-01', 'I-62-G-NLGGS.19.2128', 3800, '02', 'จัดซื้อเครื่องทำน้ำเย็น กฟย.ภาชี'),
(31, '1.1.29', '2019-02-05', 'I-62-G-RSTGS.19.2129', 30000, '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟฟ.รสต.'),
(32, '1.1.30', '2019-02-05', 'I-62-G-RSTGS.19.2130', 32600, '03', 'จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟฟ.รสต.'),
(33, '1.1.31', '2019-02-06', 'I-62-G-POPGS.19.2131', 26158.88, '03', 'จัดซื้อ LED TV ให้ กฟก.1'),
(34, '1.1.32', '2019-02-07', 'I-62-G-ATGGS.19.2132', 71700, '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.ไชโย'),
(35, '1.1.33', '2019-02-08', 'I-62-G-SBIGS.19.2133', 45000, '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.เสาไห้'),
(36, '1.1.34', '2019-02-11', 'I-62-G-WCNGS.19.2134', 19600, '03', 'จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟย.สามโก้'),
(37, '1.1.35', '2019-02-13', 'I-62-G-RSTGS.19.2135', 34570.09, '03', 'จัดซื้อโทรทัศน์ LED ให้ กฟฟ.รังสิต'),
(38, '1.1.36', '2019-02-14', 'I-62-G-AYYGS.19.2136', 72000, '03', 'จัดซื้อครุภัณฑ์สำนักงานให้กฟจ.อยุธยา'),
(39, '1.1.37', '2019-02-14', 'I-62-G-WNIGS.19.2137', 97000, '03', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟอ.วังน้อย'),
(40, '1.1.38', '2019-02-21', 'I-62-G-AYYGS.19.2138', 6500, '03', 'จัดซื้อนาฬิกายาม ให้  กฟจ.อยุธยา'),
(41, '1.1.39', '2019-02-22', 'I-62-G-AYYGS.19.2139', 16300, '03', 'จัดซื้อโต๊ะทำงานพร้อมเก้าอี้ให้กฟจ.อย.'),
(42, '1.1.40', '2019-02-22', 'I-62-G-PBIGS.19.2140', 6074.77, '03', 'จัดซื้อโต๊ะหมู่บูชาที่ กฟจ.ปราจีนบุรี'),
(43, '1.1.41', '2019-02-22', 'I-62-G-BINGS.19.2141', 10271.03, '03', 'จัดซื้อโทรทัศน์  ให้ กฟอ.บางปะอิน'),
(44, '1.1.42', '2019-02-22', 'I-62-G-LLOGS.19.2142', 3448.6, '03', 'จัดซื้อเครื่องทำน้ำเย็นกฟอ.ลาดหลุมแก้ว'),
(45, '1.1.43', '2019-02-22', 'I-62-G-LLOGS.19.2143', 14859.81, '03', 'จัดซื้อเครื่องดูดฝุ่น ให้ กฟอ.ลลก.'),
(46, '1.1.44', '2019-02-22', 'I-62-G-BINGS.19.2144', 16000, '03', 'จัดซื้อตู้เก็บเอกสาร ที่ กฟอ.บางปะอิน'),
(47, '1.1.45', '2019-02-25', 'I-62-G-PBIGS.19.2145', 19626.15, '03', 'ซื้อโต๊ะและเก้าอี้รับรองแขกให้กฟจ.ปจ.'),
(48, '1.1.46', '2019-02-27', 'I-62-G-NLGGS.19.2146', 105420.56, '03', 'จัดซื้อเครื่องปรับอากาศ ที่ กฟย.ภาชี'),
(49, '1.1.47', '2019-03-08', 'I-62-G-EAPEA.19.2147', 383050, '08', 'ซื้อครุณฑ์สำนักงานสถานีอัดประจุไฟฟ้าก1'),
(50, '1.1.48', '2019-03-12', 'I-62-G-OPDOP.19.2148', 115000, '04', 'จัดซื้อนาฬิกายามให้สฟ.ฯ10 แห่ง กปบ.ก.1'),
(51, '1.1.49', '2019-03-12', 'I-62-G-OPDOP.19.2149', 115000, '04', 'จัดซื้อนาฬิกายามให้สฟ.ฯ10แห่ง  กปบ.ก.1'),
(52, '1.1.50', '2019-03-13', 'I-62-G-SBIGS.19.2150', 4383.18, '05', 'จัดซื้อเครื่องทำน้ำเย็นที่ กฟย.เสาไห้'),
(53, '1.1.51', '2019-03-13', 'I-62-G-SBIGS.19.2151', 32400, '05', 'จัดซื้อเก้าอี้ประชุมฯกฟย.เสาไห้'),
(54, '1.1.52', '2019-03-15', 'I-62-G-SKEGS.19.2152', 4579.44, '05', 'เครื่องทำน้ำเย็นน้ำร้อนที่กฟยเขาฉกรรจ์'),
(55, '1.1.53', '2019-03-15', 'I-62-G-SENGS.19.2153', 55000, '05', 'ซื้อโต๊ะทำงานพร้อมเก้าอี้ให้กฟยบางบาล'),
(56, '1.1.54', '2019-03-15', 'I-62-G-SPOGS.19.2154', 51500, '05', 'ซื้อโต๊ะประชุมและเก้าอี้ให้กฟย.ศรีมโหส'),
(57, '1.1.55', '2019-03-27', 'I-62-G-TYIGS.19.2155', 0, '05', '0จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟอ.ธญ.'),
(58, '1.1.56', '2019-03-28', 'I-62-G-AYYGS.19.2156', 25300, '', 'จัดซื้อตู้นิรภัยให้ แก้ กฟจ.อย.'),
(59, '1.1.57', '2019-03-29', 'I-62-G-NOKCA.19.2157', 99000, '05', 'ติดตั้งม่านปรับแสงที่ กฟอ.หนองแค'),
(60, '1.1.58', '2019-04-01', 'I-62-G-WNIGS.19.2158', 26000, '05', 'ซื้อตู้เก็บของแบบแบ่งเป็นช่อง กฟอ.วน.'),
(61, '1.1.59', '2019-04-01', 'I-62-G-AYYGS.19.2159', 144000, '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.'),
(62, '1.1.60', '2019-04-02', 'I-62-G-WTNGS.19.2160', 38500, '05', 'จัดซื้อโต๊ะระชุม,เก้าอี้ให้กฟย.คลองหาด'),
(63, '1.1.61', '2019-04-04', 'I-62-G-SPOGS.19.2161', 40400, '05', '0จัดซื้อโต๊ะประชุมและเก้าอี้ กฟยท่าตูม'),
(64, '1.1.62', '2019-04-04', 'I-62-G-SENGS.19.2162', 40400, '05', 'จัดซื้อโต๊ะระชุม,เก้าอี้ให้กฟย.บางบาล'),
(65, '1.1.63', '2019-04-04', 'I-62-G-SENGS.19.2163', 28000, '05', 'จัดซื้อโต๊ะประชุมเก้าอี้ให้กฟย.บางซ้าย'),
(66, '1.1.64', '2019-04-04', 'I-62-G-SENGS.19.2164', 7500, '05', 'โต๊ะ,เก้าอี้ศูนย์ พ.ร.บ.ให้กฟย.บางซ้าย'),
(67, '1.1.65', '2019-04-04', 'I-62-G-AYYGS.19.2165', 174900, '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.'),
(68, '1.1.66', '2019-04-04', 'I-62-G-AYYGS.19.2166', 408200, '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.อย.'),
(69, '1.1.67', '2019-04-09', 'I-62-G-WNIGS.19.2167', 81200, '05', 'จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟอ.วน.'),
(70, '1.1.68', '2019-04-09', 'I-62-G-PBIGS.19.2168', 211500, '08', '8จัดซื้อโต๊ะทำงาน,เก้าอี้ ให้ กฟจ.ปจ.'),
(71, '1.1.69', '2019-05-03', 'I-62-G-SKEGS.19.2169', 35000, '05', 'จัดซื้อโต๊ะประชุมเก้าอี้กฟย.เขาฉกรรจ์'),
(72, '1.1.70', '2019-05-03', 'I-62-G-KBRGS.19.2170', 26644.86, '06', 'จัดซื้อโต๊ะเก้าอี้ฯ ให้ กฟย.วังตะเคียน'),
(73, '1.1.71', '2019-05-07', 'I-62-G-TREGS.19.2171', 4710.28, '05', 'จัดซื้อเครื่องทำน้ำเย็น ให้ กฟย.ดอนพุด'),
(74, '1.1.72', '2019-05-07', 'I-62-G-SENGS.19.2172', 4579.44, '05', 'จัดซื้อเครื่องทำน้ำเย็น ให้ กฟย.บางบาล'),
(75, '1.1.73', '2019-05-08', 'I-62-G-APTGS.19.2173', 38500, '06', 'จัดซื้อโต๊ะเก้าอี้ฯ ให้ กฟย.โคกสูง'),
(76, '1.1.74', '2019-05-16', 'I-62-G-APTGS.19.2174', 30900, '09', 'โต๊ะประชุม,เก้าอี้ฯให้ กฟย.ตาพระยา'),
(77, '1.1.75', '2019-05-27', 'I-62-G-SBIGS.19.2175', 246000, '07', 'ตู้เก็บเอกสารโต๊ะทานอาหารฯกฟจ.สบ.'),
(78, '1.1.76', '2019-05-27', 'I-62-G-ACTGS.19.2176', 10345.79, '06', 'จัดซื้อเก้าอี้ทำงานให้ กบญ.ก.1'),
(79, '1.1.77', '2019-05-29', 'I-62-G-CSDCS.19.2177', 336000, '08', 'เครื่องแสดงภาพ(โทรทัศน์)อาคาร2ชั้น4ก.1'),
(80, '1.1.78', '2019-06-06', 'I-62-G-AMDGS.19.2178', 4663.55, '07', 'จัดซื้อเก้าอี้ ให้ อก.อก.ก.1'),
(81, '1.1.79', '2019-06-14', 'I-62-G-BINGS.19.2179', 39205.61, '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟอ.บปอ'),
(82, '1.1.80', '2019-06-17', 'I-62-G-PNIGS.19.2180', 38691.6, '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟฟ.ปนอ'),
(83, '1.1.81', '2019-06-18', 'I-62-G-APTGS.19.2181', 26915.89, '07', 'ซื้อเครื่องน้ำร้อน-น้ำเย็น ให้ กฟอ.อป.'),
(84, '1.1.82', '2019-06-26', 'I-62-G-AYYIC.19.2182', 15000, '07', '8จัดซื้อโต๊ะทำงานและเก้าอี้ให้ กฟจ.อย.'),
(85, '1.1.83', '2019-06-27', 'I-62-G-POPGS.19.2183', 4300, '08', '8จัดซื้อโต๊ะพร้อมเก้าอี้ทำงานให้ หผ.ซฟ'),
(86, '1.1.84', '2019-07-02', 'I-62-G-CAPCW.19.2184', 139400, '08', '2ติดตั้งบอร์ดผู้บิหาร ที่ กฟก.1'),
(87, '1.1.85', '2019-07-03', 'I-62-G-CSDCE.19.2185', 1510000, '11', '6ซื้อพร้อมติดMontor Display ที่กฟก.1'),
(88, '1.1.86', '2019-07-05', 'I-62-G-AYYGS.19.2186', 459600, '08', '8จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟจ.อย'),
(89, '1.1.87', '2019-07-09', 'I-62-G-ACTGS.19.2187', 9252.34, '08', '7จัดซื้อเก้าอี้ทำงาน ให้ กบญ.ก.1'),
(90, '1.1.88', '2019-07-09', 'I-62-G-LLKGS.19.2188', 43551.4, '10', '8จัดซื้อครุภัณฑ์สำนักงาน ให้ กฟส.ลบล.'),
(91, '1.1.89', '2019-07-15', 'I-62-G-EAPAE.19.2189', 39252.34, '09', '3ติดตั้งเครื่องปรับอากาศที่สถ.ECS ก.1'),
(92, '1.1.90', '2019-07-19', 'I-62-G-TYIGS.19.2190', 31000, '08', '8จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.ธญ'),
(93, '1.1.91', '2019-07-23', 'I-62-G-PBIGS.19.2191', 21392.52, '08', '8จัดซื้อเครื่องดูดฝ่นฯ กฟจ.ปจ.'),
(94, '1.1.92', '2019-07-23', 'I-62-G-PBIGS.19.2192', 41120, '08', '8จัดซื้อตู้เก็บเอกสาร,ตู้โชว์ กฟจ.ปจ.'),
(95, '1.1.93', '2019-07-24', 'I-62-G-PNIGS.19.2193', 17747.66, '10', 'จัดซื้อโทรทัศน์ฯ ให้ กฟฟ.ปนอ.'),
(96, '1.1.94', '2019-07-25', 'I-62-G-PCMGS.19.2194', 30500, '09', '8จัดซื้อโต๊ะประชุม ให้ กฟส.ปจค.'),
(97, '1.1.95', '2019-08-20', 'I-62-G-SENGS.19.2195', 4579.44, '09', 'จัดซื้อเครื่องทำน้ำเย็นให้ กฟย.บางซ้าย'),
(98, '1.1.96', '2019-08-20', 'I-62-G-WNNXX.19.2196', 38500, '09', 'โต๊ะประชุและเก้าอี้ กฟย.วังสมบูรณ์'),
(99, '1.1.97', '2019-08-22', 'I-62-G-EAPGS.19.2197', 29990, '09', 'ติดบม่านพร้อมชุดเพื่อใช้งานที่ กวว.1'),
(100, '1.1.98', '2019-08-22', 'I-62-G-ACTGS.19.2198', 22400, '09', 'จัดซื้อเก้าอี้ประชุมที่ กบญ.ก.1'),
(101, '1.1.99', '2019-08-22', 'I-62-G-XXXGS.19.2199', 12728.97, '09', 'จัดซื้อเก้าอี้ ให้ อข.ก.1'),
(102, '1.1.100', '2019-08-26', 'I-62-G-AMDLA.19.21AA', 25658.88, '09', 'จัดซื้อเก้าอี้ ให้ กม.ก.1'),
(103, '1.1.101', '2019-08-29', 'I-62-G-SPOGS.19.21AB', 18400, '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กฟย.ท่าตูม'),
(104, '1.1.102', '2019-08-29', 'I-62-G-WDGGS.19.21AC', 30000, '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กฟสวิหารแดง'),
(105, '1.1.103', '2019-08-29', 'I-62-G-LLOCM.19.21AD', 13000, '09', 'จัดซื้อโทรทัศน์ ให้  กฟอ.ลาดหลุมแก้ว'),
(106, '1.1.104', '2019-09-03', 'I-62-G-NNKGS.19.21AE', 6074.77, '10', 'จัดซื้อโต๊ะประชุมที่ กฟย.ปากพลี'),
(107, '1.1.105', '2019-09-03', 'I-62-G-EAPGS.19.21AF', 29990, '10', 'ติดตั้งม่านพร้อมชุดใช้งาน อาคาร1ชั้น3'),
(108, '1.1.106', '2019-09-03', 'I-62-G-EAPGS.19.21AI', 16056.06, '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กวว.ก1'),
(109, '1.1.107', '2019-09-04', 'I-62-G-CTSGS.19.21AJ', 22000, '09', 'ซื้อโตีะทำงานและเก้าอี้ให้ กบล.ก.1'),
(110, '1.1.108', '2019-09-04', 'I-62-G-TREGS.19.21AK', 41800, '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.ทรอ.'),
(111, '1.1.109', '2019-09-06', 'I-62-G-KBRGS.19.21AL', 158000, '11', 'โต๊ะประชุมและเก้าอี้ที่ กฟอ.กบบ.'),
(112, '1.1.110', '2019-09-09', 'I-62-G-WNNGS.19.21AM', 11400, '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟส.วนย.'),
(113, '1.1.111', '2019-09-09', 'I-62-G-KKIGS.19.21AN', 37800, '10', 'จัดซื้อตู้เหล็กฯ ที่ กฟอ.แก่งคอย'),
(114, '1.1.112', '2019-09-09', 'I-62-G-KKIGS.19.21AO', 18400, '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.กคย.'),
(115, '1.1.113', '2019-09-10', 'I-62-G-AYYGS.19.21AP', 103800, '10', 'จัดซื้อโต๊ะอาหารและเก้าอี้ที่ กฟจ.อย.'),
(116, '1.1.114', '2019-09-10', 'I-62-G-AYYGS.19.21AQ', 108200, '10', 'จัดซื้อโต๊ะประชุมและเก้าอี้ ที่ กฟจ.อย'),
(117, '1.1.115', '2019-09-10', 'I-62-G-KBRGS.19.21AR', 26355.14, '10', 'จัดซื้อทำน้ำเย็น ที่ กฟอ.กบินทร์บุรี'),
(118, '1.1.116', '2019-09-10', 'I-62-G-APTGS.19.21AS', 7383.18, '10', 'จัดซื้อตู้เก็บเอกสารฯที่ กฟอ.อป.'),
(119, '1.1.117', '2019-09-12', 'I-62-G-APTGS.19.21AT', 35327.1, '10', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟอ.อป.'),
(120, '1.1.118', '2019-09-12', 'I-62-G-APTGS.19.21AU', 0, '', 'ยกเลิก'),
(121, '1.1.119', '2019-09-12', 'I-62-G-SBIGS.19.21AU', 32700.93, '10', 'จัดซื้อกล้องถ่ายฯ ให้ กฟจ.สระบุรี'),
(122, '1.1.120', '2019-09-13', 'I-62-G-XXXGS.19.21AV', 16327.1, '11', 'ชุดรับแขกที่สถานที่รับรองลูกค้า กฟก.1'),
(123, '1.1.121', '2019-09-18', 'I-62-G-ACTUP.19.21AW', 0, '', 'ยกเลิก'),
(124, '1.1.122', '2019-09-18', 'I-62-G-APTAP.19.21AX', 25514.03, '10', 'จัดซื้อโต๊ะและเก้าอี้แถ้วฯที่ กฟอ.อป.'),
(125, '1.1.123', '2019-09-19', 'I-62-G-BSGGS.19.21AY', 18400, '10', 'จัดซื้อตู้ล๊อกเกอร์ ให้ กฟส.บส.'),
(126, '1.1.124', '2019-09-20', 'I-62-G-SKOAF.19.21AZ', 30747.66, '10', 'จัดซื้อเครื่องนับธนบัตร ให้ กฟส.สามโคก'),
(127, '1.1.125', '2019-09-20', 'I-62-G-SKEGS.19.21BA', 40100, '10', 'จัดซื้อเก้าอี้ประชุมที่ กฟจ.สระแก้ว'),
(128, '1.1.126', '2019-09-20', 'I-62-G-PNICM.19.21BB', 30373.83, '10', 'จัดซื้อกล้องถ่ายฯ ให้ กฟฟ.ปตน.'),
(129, '1.1.127', '2019-09-23', 'I-62-G-AMDLA.19.21BC', 9345.79, '10', 'จัดซื้อตู้เก็บเอกสารให้ กอก.ก.1'),
(130, '1.1.128', '2019-09-25', 'I-62-G-ACTPU.19.21AW', 21682.24, '10', 'จัดซื้อSmart TVให้ กบญ.ก.1'),
(131, '1.1.129', '2019-09-26', 'I-62-G-KBRGS.19.21BD', 401300, '10', 'จัดซื้อโต๊ะทำงานและเก้าอี้ ให้ กฟอ.กบบ'),
(132, '1.1.130', '2019-10-08', 'I-62-G-ACTGS.19.21BE', 7243.27, '10', 'จัดซื้อตู้น้ำดื่มให้ กบญ.ก.1'),
(133, '1.1.131', '2019-10-09', 'I-62-G-SBIGS.19.21BF', 40400, '11', 'จัดซื้อโต๊ะประชุมและเก้าอี้กฟย.หนองแซง'),
(134, '1.1.132', '2019-10-11', 'I-62-G-PPTGS.19.21BG', 68131, '11', 'จัดซื้อครุภัณฑ์สำนักงานให้ กฟย.หนองโดน'),
(135, '1.1.133', '2019-10-18', 'I-62-G-APTGS.19.21BH', 3700, '11', 'จัดซื้อเก้าอี้ทำงานให้ กฟย.ตาพระยา'),
(136, '1.1.134', '2019-11-04', 'I-62-G-SKEGS.19.21BI', 35514.02, '12', 'เครื่องปรับอากาศที่ กฟย.เขาฉกรรจ์'),
(137, '', '0000-00-00', '', 8503583.58, '', 'รวม 1.1 I-62-G-POPXX.19.2100 ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ'),
(138, '1.2', '2018-09-14', 'I-62-G-POPXX.19.2200', 0, '', 'ครุภัณฑ์สื่อสาร'),
(139, '1.2.1', '2019-01-04', 'I-62-G-APTOP.19.2201', 75000, '02', 'ติดตั้งระบบแจ้งเตือนอัคคีภัยที่สฟอญ2ชค'),
(140, '1.2.2', '2019-01-04', 'I-62-G-LLAOP.19.2202', 75000, '02', 'ระบบแจ้งเตือนอัคคีภัยที่สฟคลองสอง(ชค)'),
(141, '1.2.3', '2019-01-09', 'I-62-G-OPDDP.19.2203', 61200, '04', 'จัดซื้อแบตเตอรี่ระบบไฟฟ้าสำรองฯกปบ.ก.1'),
(142, '1.2.4', '2019-01-09', 'I-62-G-OPDDP.19.2204', 345600, '07', 'จัดซื้อแบตเตอรี่ระบบไฟฟ้าสำรอง กปบ.ก.1'),
(143, '1.2.5', '2019-01-23', 'I-62-G-OPDDP.19.2205', 75000, '03', 'ระบบแจ้งเตือนอัคคีภัยที่สฟ.คลองหนึง.ชค'),
(144, '1.2.6', '2019-01-29', 'I-62-G-CSDCS.19.2206', 452000, '05', 'จัดซื้อเครื่องรับส่งวิทยุฯ ให้ กรส.ก.1'),
(145, '1.2.7', '2019-03-08', 'I-62-G-KBRCS.19.2207', 0, '', 'ยกเลิก'),
(146, '1.2.8', '2019-03-08', 'I-62-G-CSDCS.19.2207', 33000, '05', 'จัดซื้อชุดเครื่องเสียงฯ ให้ กฟอ.กบบ.'),
(147, '1.2.9', '2019-03-08', 'I-62-G-CSDCS.19.2208', 60000, '07', 'ติดตั้งระบบโทรทัศน์วงจรปิดที่ ก.1'),
(148, '1.2.10', '2019-03-29', 'I-62-G-CSDCS.19.2209', 60000, '07', 'ระบบโทรทัศน์วงจรปิดโรงเก็บอุปกรณ์ ก.1'),
(149, '1.2.11', '2019-04-05', 'I-62-G-LLOCS.19.2210', 0, '', 'ยกเลิก'),
(150, '1.2.12', '2019-04-05', 'I-62-G-CSDGS.19.2212', 0, '', 'ยกเลิก'),
(151, '1.2.13', '2019-04-25', 'I-62-G-CSDCS.19.2213', 25000, '06', 'จัดซื้อชุดเครื่องบันทึกโทรศัพท์ฯกฟฟรสต'),
(152, '1.2.14', '2019-04-29', 'I-62-G-CSDCS.19.2210', 33000, '05', 'จัดซื้อชุดเครื่องเสียง กฟอ.ลาดหลุมแก้ว'),
(153, '1.2.15', '2019-04-30', 'I-62-G-CSDCS.19.2211', 60000, '07', 'ระบบโทรทัศน์วงจรปิดที่คลังพัสดุ กฟจ.อย'),
(154, '', '0000-00-00', '', 1354800, '', 'รวม 1.2 I-62-G-POPXX.19.2200 ครุภัณฑ์สื่อสาร'),
(155, '1.3', '2018-09-14', 'I-62-G-POPXX.19.2300', 0, '', 'เครื่องมือเครื่องใช้, คลังพัสดุ'),
(156, '1.3.1', '2019-01-04', 'I-62-G-PTBEA.19.2301', 95000, '02', 'เครื่องมือตรวจสอบแรงดันฯ กฟฟ.ปท.2บกด.'),
(157, '1.3.2', '2019-01-08', 'I-62-G-AYYCT.19.2302', 48000, '02', 'เครื่องมือเครื่องใช้ฯ กฟจ.อยุธยา'),
(158, '1.3.3', '2019-01-08', 'I-62-G-ATGCT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.อ่างทอง'),
(159, '1.3.4', '2019-01-08', 'I-62-G-SBICT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.สระบุรี'),
(160, '1.3.5', '2019-01-08', 'I-62-G-NOKCT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.หนองแค'),
(161, '1.3.6', '2019-01-08', 'I-62-G-BHKCT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟฟ.หินกอง'),
(162, '1.3.7', '2019-01-08', 'I-62-G-PBICT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.ปราจีนบุรี'),
(163, '1.3.8', '2019-01-08', 'I-62-G-SPOCT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.ศรีมหาโพธิ'),
(164, '1.3.9', '2019-01-08', 'I-62-G-NNKCT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.นครนายก'),
(165, '1.3.10', '2019-01-08', 'I-62-G-PTICT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.ปทุมธานี'),
(166, '1.3.11', '2019-01-08', 'I-62-G-LLOCT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.ลาดหลุมแก้ว'),
(167, '1.3.12', '2019-01-08', 'I-62-G-APTCT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.อรัญประเทศ'),
(168, '1.3.13', '2019-01-08', 'I-62-G-RSTCT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟฟ.รังสิต'),
(169, '1.3.14', '2019-01-08', 'I-62-G-KLGCT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.คลองหลวง'),
(170, '1.3.15', '2019-01-08', 'I-62-G-SENCT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.เสนา'),
(171, '1.3.16', '2019-01-08', 'I-62-G-PPTCT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.พระพุทธบาท'),
(172, '1.3.17', '2019-01-08', 'I-62-G-TRECT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.ท่าเรือ'),
(173, '1.3.18', '2019-01-08', 'I-62-G-KBRCT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.กบินทร์บุรี'),
(174, '1.3.19', '2019-01-08', 'I-62-G-TYICT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.ธัญบุรี'),
(175, '1.3.20', '2019-01-08', 'I-62-G-BINCT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.บางปะอิน'),
(176, '1.3.21', '2019-01-08', 'I-62-G-PNICT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชกฟฟประตูน้ำพระอินทร'),
(177, '1.3.22', '2019-01-08', 'I-62-G-KKICT.19.2302', 48000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.แก่งคอย'),
(178, '1.3.23', '2019-01-08', 'I-62-G-SKECT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟจ.สระแก้ว'),
(179, '1.3.24', '2019-01-08', 'I-62-G-PTBCT.19.2302', 45000, '02', 'เครื่องมือเครื่องใชฯกฟอ.ปทุมธานี2(บกด)'),
(180, '1.3.25', '2019-01-08', 'I-62-G-WNICT.19.2302', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.วังน้อย'),
(181, '1.3.26', '2019-01-08', 'I-62-G-LLACT.19.2302', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟอ.ลำลูกกา'),
(182, '1.3.27', '2019-01-08', 'I-62-G-NLGCT.19.2303', 17000, '02', 'เครื่องมือเครื่องใชฯ กฟย.ภาชี'),
(183, '1.3.28', '2019-01-08', 'I-62-G-BGHCT.19.2303', 98000, '02', 'เครื่องมือเครื่องใชกฟย.มหาราช,บ้านแพรก'),
(184, '1.3.29', '2019-01-08', 'I-62-G-ATGCT.19.2303', 25000, '02', 'เครื่องมือเครื่องใชฯ กฟย.ไชโย'),
(185, '1.3.30', '2019-01-08', 'I-62-G-WCNCT.19.2303', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟย.สามโก้'),
(186, '1.3.31', '2019-01-09', 'I-62-G-PTGCT.19.2303', 21000, '02', 'เครื่องมือเครื่องใชฯ กฟย.แสวงหา'),
(187, '1.3.32', '2019-01-09', 'I-62-G-SBICT.19.2303', 71600, '02', 'เครื่องมือเครื่องใชฯกฟย.เสาไห้,หนองแซง'),
(188, '1.3.33', '2019-01-09', 'I-62-G-NNKCT.19.2303', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟย.ปากพลี'),
(189, '1.3.34', '2019-01-09', 'I-62-G-APTCT.19.2303', 98000, '', ''),
(190, '1.3.35', '2019-01-09', 'I-62-G-WTNCT.19.2303', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟย.คลองหาด'),
(191, '1.3.36', '2019-01-09', 'I-62-G-SENCT.19.2303', 85000, '02', 'เครื่องมือเครื่องใชฯกฟย.บางบาล,บางซ้าย'),
(192, '1.3.37', '2019-01-09', 'I-62-G-LLKCT.19.2303', 49000, '02', 'เครื่องมือเครื่องใชฯ กฟย.บางไทร'),
(193, '1.3.38', '2019-01-09', 'I-62-G-PPTCT.19.2303', 49000, '02', 'เครื่องมือเครื่องใชฯกฟย.หนองโดน'),
(194, '1.3.39', '2019-01-09', 'I-62-G-TRECT.19.2303', 50000, '02', 'เครื่องมือเครื่องใชฯกฟย.บ้านหมอ,ดอนพุด'),
(195, '1.3.40', '2019-01-09', 'I-62-G-KBRCT.19.2303', 48000, '02', 'เครื่องมือเครื่องใชฯกฟย.วังตะเคียน'),
(196, '1.3.41', '2019-01-09', 'I-62-G-MKLCT.19.2303', 98000, '02', 'เครื่องมือเครื่องใชกฟยวังม่วง,ซับสนุ่น'),
(197, '1.3.42', '2019-01-09', 'I-62-G-SKECT.19.2303', 30000, '02', 'เครื่องมือเครื่องใชฯกฟย.เขาฉกรรณ์'),
(198, '1.3.43', '2019-01-09', 'I-62-G-WNNCT.19.2303', 24000, '02', 'เครื่องมือเครื่องใชฯกฟย.วังสมบูรณ์'),
(199, '1.3.44', '2019-01-09', 'I-62-G-SPOCT.19.2303', 77000, '02', 'เครื่องมือเครื่องใชฯกฟยศรีมโหสถ,ท่าตูม'),
(200, '1.3.45', '2019-01-09', 'I-62-G-SKOCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.สามโคก'),
(201, '1.3.46', '2019-01-09', 'I-62-G-NNSCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.หนองเสือ'),
(202, '1.3.47', '2019-01-09', 'I-62-G-PHICT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.ผักไห่'),
(203, '1.3.48', '2019-01-09', 'I-62-G-UTHCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.อุทัย'),
(204, '1.3.49', '2019-01-09', 'I-62-G-BGHCT.19.2304', 68000, '02', 'เครื่องมือเครื่องใชฯกฟส.บางปะหัน'),
(205, '1.3.50', '2019-01-09', 'I-62-G-LLKCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.ลาดบัวหลวง'),
(206, '1.3.51', '2019-01-09', 'I-62-G-NLGCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.นครหลวง'),
(207, '1.3.52', '2019-01-09', 'I-62-G-WCNCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.วิเศษชัยชาย'),
(208, '1.3.53', '2019-01-09', 'I-62-G-PTGCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.โพธิ์ทอง'),
(209, '1.3.54', '2019-01-09', 'I-62-G-PMKCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.ป่าโมก'),
(210, '1.3.55', '2019-01-09', 'I-62-G-NADCT.19.2304', 68000, '02', 'เครื่องมือเครื่องใชฯกฟส.นาดี'),
(211, '1.3.56', '2019-01-09', 'I-62-G-BNACT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.บ้านนา'),
(212, '1.3.57', '2019-01-09', 'I-62-G-OKKCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.องค์รักษ์'),
(213, '1.3.58', '2019-01-09', 'I-62-G-WTNCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.วัฒนานคร'),
(214, '1.3.59', '2019-01-09', 'I-62-G-WNNCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.วังน้ำเย็น'),
(215, '1.3.60', '2019-01-09', 'I-62-G-BSGCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.บ้านสร้าง'),
(216, '1.3.61', '2019-01-09', 'I-62-G-WDGCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.วิหารแดง'),
(217, '1.3.62', '2019-01-10', 'I-62-G-MKLCT.19.2304', 68000, '02', 'เครื่องมือเครื่องใชฯกฟส.มวกเหล็ก'),
(218, '1.3.63', '2019-01-10', 'I-62-G-PCMCT.19.2304', 49000, '02', 'เครื่องมือเครื่องใชฯกฟส.ประจันตคาม'),
(219, '1.3.64', '2019-01-28', 'I-62-G-AYYGS.19.2305', 8130.84, '02', 'เครื่องตัดหญ้า ให้ กฟจ.อยุธยา'),
(220, '1.3.65', '2019-02-22', 'I-62-G-EAPEA.19.2306', 1373944, '08', 'เครื่องมือตรวจสอบแรงดันฯให้ กวว.ก.1'),
(221, '1.3.66', '2019-02-22', 'I-62-G-EAPEA.19.2307', 3840000, '10', 'เครื่องมือต่อสายลงดินแรงสูงฯให้ กวว.1'),
(222, '1.3.67', '2019-02-22', 'I-62-G-EAPEA.19.2308', 2886000, '10', 'เครื่องมือไม้ชักฟิวส์ฯให้ กวว.1'),
(223, '1.3.68', '2019-04-09', 'I-62-G-WDGMA.19.2309', 20000, '05', 'เครื่องมือให้ กฟส.วิหารแดง'),
(224, '1.3.69', '2019-06-13', 'I-62-G-KLGCT.19.2310', 5000, '07', 'ซื้อล้อวัดระยะทาง ให้ กฟอ.คลองหลวง'),
(225, '1.3.70', '2019-10-31', 'I-62-G-PCMGS.19.2311', 7429.9, '11', 'จัดซื้อเครื่องตัดหญ้าฯ กฟส.ประจันตคาม'),
(226, '', '0000-00-00', '', 11201104.74, '', 'รวม 1.3 I-62-G-POPXX.19.2300 เครื่องมือเครื่องใช้, คลังพัสดุ'),
(227, '1.4', '2018-09-14', 'I-62-G-POPXX.19.2400', 0, '', 'คอมพิวเตอร์'),
(228, '1.4.1', '2019-01-31', 'I-62-G-CSDCS.19.2401', 84000, '03', 'จัดซื้อเครื่องสำรองไฟUPSฯกรส.ก.1'),
(229, '1.4.2', '2019-03-11', 'I-62-G-ITSIT.19.2402', 60373.83, '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.สามโก้'),
(230, '1.4.3', '2019-03-11', 'I-62-G-ITSIT.19.2403', 98971.96, '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.ภาชี'),
(231, '1.4.4', '2019-03-11', 'I-62-G-ITSIT.19.2404', 118364.49, '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.วังม่วง'),
(232, '1.4.5', '2019-03-11', 'I-62-G-ITSIT.19.2405', 73317.76, '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.เสาไห้'),
(233, '1.4.6', '2019-03-11', 'I-62-G-ITSIT.19.2406', 73317.76, '06', 'ติดตั้งระบบสายสัญญาณให้ กฟย.ตาพระยา'),
(234, '1.4.7', '2019-03-11', 'I-62-G-ITSIT.19.2407', 351360, '06', 'ซื้อตู้RACKระบบเครือข่ายให้กับกฟย.ก.1'),
(235, '1.4.8', '2019-03-13', 'I-62-G-OPDOP.19.2408', 0, '', 'ยกเลิก'),
(236, '1.4.9', '2019-09-19', 'I-62-G-ITSCN.19.2408', 125000, '12', 'ซื้อต้RACKพร้อมอุปกรณ์ที่ เขต กฟก.1'),
(237, '1.4.10', '2019-10-02', 'I-62-G-ITSCN.19.2409', 90560.75, '11', 'ติดตั้งระบบเครือข่าย ให้ กรท.ก.1'),
(238, '1.4.11', '2019-10-02', 'I-62-G-ITSCN.19.2410', 92289.72, '11', 'ติดตั้งระบบเครือข่าย ให้ กซข.ก.1'),
(239, '', '0000-00-00', '', 1167556.27, '', 'รวม 1.4 I-62-G-POPXX.19.2400 คอมพิวเตอร์'),
(240, '1.5', '2018-09-14', 'I-62-G-POPXX.19.2500', 0, '', 'ยานพาหนะ'),
(241, '1.6', '2018-09-14', 'I-62-G-POPXX.19.2600', 0, '', 'ที่ดิน, ปรับปรุงที่ดิน'),
(242, '1.7', '2018-09-14', 'I-62-G-POPXX.19.2700', 0, '', 'สิ่งก่อสร้าง'),
(243, '1.8', '2018-09-14', 'I-62-G-POPXX.19.2800', 0, '', 'ต่อเติม, ปรับปรุง'),
(244, '1.8.1', '2019-01-04', 'I-62-G-SPOCA.19.2801', 0, '', 'ยกเลิก'),
(245, '1.8.2', '2019-01-04', 'I-62-G-SPOCA.19.2802', 829906.54, '03', ' กส.ลาน คสล. กฟอ.ศม.'),
(246, '1.8.3', '2019-01-04', 'I-62-G-PBICA.19.2803', 623364.49, '03', 'ปป.เทลานคอนกรีตฯที่ กฟจ.ปจ.'),
(247, '1.8.4', '2019-01-06', 'I-62-G-SBICA.19.2804', 445000, '03', 'กส.ลาน คสล.คลังพัสดุ กฟจ.สบ.'),
(248, '1.8.5', '2019-01-06', 'I-62-G-APTCA.19.2805', 77400, '03', 'กส.กั้นห้องภายในอาคารชั้น 3'),
(249, '1.8.6', '2019-01-06', 'I-62-G-APTCA.19.2806', 72300, '03', 'กส.ห้องน้ำผู้พิการฯที่ กฟอ.อรัญประเทศ'),
(250, '1.8.7', '2019-02-14', 'I-62-G-CAPCA.19.2807', 465000, '06', 'ปป.ลาดแอสฟัลท์บิรเวณรอบหอพระ กฟก.1'),
(251, '1.8.8', '2019-02-20', 'I-62-G-NNKCA.19.2808', 327500, '06', 'กส.รั้วประตูลวดตาข่ายล้อมรอบคลังกฟจ.นย'),
(252, '1.8.9', '2019-02-20', 'I-62-G-LLKCA.19.2809', 442388, '06', 'กส.เทลานคอนกรีต กฟส.ลบล.'),
(253, '1.8.10', '2019-02-26', 'I-62-G-EAPEA.19.2810', 467000, '08', 'กส.ที่รับรองผู้ใช้ส.อัดประจุไฟฟ้า กวว.'),
(254, '1.8.11', '2019-03-28', 'I-62-G-WCNCA.19.2811', 285000, '06', 'กส.ห้องน้ำผู้พิการฯที่ กฟย.สามโก้'),
(255, '1.8.12', '2019-03-29', 'I-62-G-SBICA.19.2812', 729500, '10', 'กส.รั้วคอนกรีตบล๊อกที่คลัง กฟจ.สบ.'),
(256, '1.8.13', '2019-03-29', 'I-62-G-PMKCA.19.2813', 44750, '05', 'กส.ป้ายชื่อ สนง.ที่รั้ว กฟส.ป่าโมก'),
(257, '1.8.14', '2019-04-02', 'I-62-G-MKLCA.19.2814', 88000, '06', 'กส.ห้องน้ำคนพิเศษ ที่ กฟย.วังม่วง'),
(258, '1.8.15', '2019-04-09', 'I-62-G-CAPCA.19.2815', 428060, '07', 'ปป.ซุ้มหลังคาที่จอดรถยนต์ที่ กฟก.1'),
(259, '1.8.16', '2019-04-22', 'I-62-G-CAPCA.19.2816', 205000, '06', 'ปป.ภูมิทัศน์ด้านหน้าอาคาร 1 กฟก.1'),
(260, '1.8.17', '2019-05-14', 'I-62-G-CAPCA.19.2817', 92000, '06', 'ติดตั้งกระจกบริเวณข้างหอพระฯ ที กฟก.1'),
(261, '1.8.18', '2019-05-28', 'I-62-G-CAPCA.19.2818', 394600, '08', 'ปป.ผนังภายนอกอาคาร 1 ด้านทิศใต้ กฟก.1'),
(262, '1.8.19', '2019-05-28', 'I-62-G-SKECA.19.2819', 33800, '08', 'กส.ประตูลวดตาข่าย บานเลื่อน ที่ กฟจ.สก'),
(263, '1.8.20', '2019-06-28', 'I-62-G-EAPAE.19.2820', 25000, '09', '3ปป.ระบบส่องสว่างสถานีไฟฟ้า ก.1'),
(264, '1.8.21', '2019-07-02', 'I-62-G-CAPCW.19.2821', 0, '', 'ยกเลิก'),
(265, '1.8.22', '2019-07-03', 'I-62-G-NLGCN.19.2821', 75000, '10', '1กส.ห้องน้ำผู้พิการ กฟย.ภาชี'),
(266, '1.8.23', '2019-07-10', 'I-62-G-KBRCN.19.2822', 23500, '09', '2ปป.ทางเท้าสาธารณะที่ กฟอ.กบบ.'),
(267, '1.8.24', '2019-07-15', 'I-62-G-APTCN.19.2823', 80000, '08', '1กส.ห้องน้ำผู้พิการ ให้ กฟย.ตาพระยา'),
(268, '1.8.25', '2019-09-05', 'I-62-G-CAPCA.19.2824', 449800, '11', 'ปป.เวทีทำตู้ชั้นโชว์ฝ้าเพดานที่ กฟก.1'),
(269, '1.8.26', '2019-09-13', 'I-62-G-APTCN.19.2825', 9500, '10', 'กั้นห้องภายในอาคารโรงเก็บพัสดุฯ กฟจ.อป'),
(270, '1.8.27', '2019-10-08', 'I-62-G-POPGS.19.2826', 262700, '12', 'ปป.พื้นที่ปฏิบัติงานตรงพื้นที่ กซข.ก.1'),
(271, '1.8.28', '2019-10-16', 'I-62-G-BHKCN.19.2827', 82800, '11', 'กส.ฐานอาคารสำเร็จรูปที่ กฟฟ.หกง.'),
(272, '1.8.29', '2019-10-16', 'I-62-G-MKLCN.19.2827', 82800, '11', 'กส.ฐานอาคารสำเร็จรูปที่ กฟส.มวกเหล็ก'),
(273, '', '0000-00-00', '', 7141669.03, '', 'รวม 1.8 I-62-G-POPXX.19.2800 ต่อเติม, ปรับปรุง'),
(274, '1.9', '2018-09-14', 'I-62-G-POPXX.19.2900', 23514.79, '', 'ขยายเขต'),
(275, '1.9.1', '2019-01-03', 'I-62-G-LLACT.19.2901', 16100, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL10)'),
(276, '1.9.2', '2019-01-03', 'I-62-G-LLACT.19.2902', 6900, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(LLK09)'),
(277, '1.9.3', '2019-01-03', 'I-62-G-LLACT.19.2903', 16800, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL04)'),
(278, '1.9.4', '2019-01-03', 'I-62-G-LLACT.19.2904', 17000, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KHL05)'),
(279, '1.9.5', '2019-01-03', 'I-62-G-LLACT.19.2905', 6900, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(LLK04)'),
(280, '1.9.6', '2019-01-03', 'I-62-G-LLACT.19.2906', 6900, '03', 'ติดตั้งมิเตอร์จุดแบ่งแดนฯกฟอ.ลก(KQU05)'),
(281, '1.9.7', '2019-01-21', 'I-62-G-AYYCT.19.2907', 4600, '10', 'ติดตั้งหม้อแปลงอาคารสำนักงานใหม่กฟจ.อย'),
(282, '1.9.8', '2019-03-29', 'I-62-G-KBRCT.19.2908', 88248, '08', 'ติตตั้งหม้อแปลงอาคารสำนักงาน กฟอ.กบบ.'),
(283, '1.9.9', '2019-04-02', 'I-62-G-SBICT.19.2909', 63032.41, '08', 'ติตตั้งหม้อแปลงอาคารสำนักงาน กฟจ.สบ.'),
(284, '', '0000-00-00', '', 249995.2, '', 'รวม 1.9 I-62-G-POPXX.19.2900 ขยายเขต'),
(285, '', '0000-00-00', '', 30000000, '', 'รวม 1 I-62-G-POPXX.19.2000 เร่งด่วน-กลุ่มธุรกิจจำหน่ายและบริการ'),
(286, '', '0000-00-00', '', 30000000, '', 'รวมทั้งสิ้น');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `test_json`
--

CREATE TABLE `test_json` (
  `id` int(11) NOT NULL,
  `transaction_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `item_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `descc` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `variant_code` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `cost` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `test_json`
--

INSERT INTO `test_json` (`id`, `transaction_number`, `date`, `item_number`, `descc`, `variant_code`, `quantity`, `cost`) VALUES
(1, 'AB-0001', '2018-08-01', '0101010', 'This is a', '002', 2, 2000),
(2, 'AB-0001', '2018-08-01', '0101010', 'This is a', '004', 3, 2000),
(3, 'AB-0001', '2018-08-01', '0101010', 'This is a', '005', 4, 2000),
(4, 'AB-0001', '2018-08-01', '0101010', 'This is a', '006', 5, 2000),
(5, 'AB-0001', '2018-08-01', '0101010', 'This is a', '008', 1, 2000),
(6, 'AB-0002', '2018-08-02', '0101010', 'This is b', '013', 2, 2000),
(7, 'AB-0002', '2018-08-02', '0101010', 'This is b', '020', 3, 2500),
(8, 'AB-0002', '2018-08-02', '0101010', 'This is b', '022', 4, 2500),
(9, 'AB-0003', '2018-08-03', '0101010', 'This is c', '007', 1, 2500),
(10, 'AB-0003', '2018-08-03', '0101010', 'This is c', '015', 7, 2500);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `token_line`
--

CREATE TABLE `token_line` (
  `id` int(11) NOT NULL,
  `token` varchar(255) NOT NULL,
  `task_id` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `namegroup_line` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `token_line`
--

INSERT INTO `token_line` (`id`, `token`, `task_id`, `id_user`, `namegroup_line`) VALUES
(1, 'GDFJDFDFgdfg44fg', 1, 3, 'groupline1'),
(2, 'ggsdgsdfasfasd', 2, 3, 'testgrouppliuneee'),
(3, 'hfhfhf', 3, 3, 'hfhfg'),
(4, 'fdkgodfpgfg', 4, 3, 'groupline');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `userpea`
--

CREATE TABLE `userpea` (
  `id_pea` int(11) NOT NULL,
  `username` int(10) NOT NULL,
  `name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Department` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Position` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `levelpea` varchar(100) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- dump ตาราง `userpea`
--

INSERT INTO `userpea` (`id_pea`, `username`, `name`, `lastname`, `Department`, `Position`, `levelpea`) VALUES
(1, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5'),
(2, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5'),
(3, 505972, 'สุภัทรา', 'มณีโชติ', 'ผสบ./กรท./ฝบพ.(ก1)/กฟก.1/รผก.(ภ3)/ผวก.', 'นรค.', 'ระดับ 5');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `งบเร่งด่วนมกรา`
--

CREATE TABLE `งบเร่งด่วนมกรา` (
  `table_name_id` int(11) NOT NULL,
  `h1` varchar(255) NOT NULL,
  `h2_1` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `h2_2` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `h3` varchar(255) NOT NULL,
  `h4` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- dump ตาราง `งบเร่งด่วนมกรา`
--

INSERT INTO `งบเร่งด่วนมกรา` (`table_name_id`, `h1`, `h2_1`, `h2_2`, `h3`, `h4`) VALUES
(1, '1', '', 'เร่งด่วน-อนุมัติจาก อข.', 'I-63-G-POPXX.19.2000', 29126219.43),
(2, '1.1', '', 'ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', 'I-63-G-POPXX.19.2100', 0),
(3, '1.1.1', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟจ.อย.', 'I-63-G-AYYGS.19.2101', 448500),
(4, '1.1.2', '02', 'จัดซื้อโต๊ะประชุมและเก้าอี้ที่ กฟฟ.รสต', 'I-63-G-RSTGS.19.2102', 92500),
(5, '1.1.3', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟจ.สบ', 'I-63-G-SBIGS.19.2103', 128460),
(6, '1.1.4', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟอ.ลก', 'I-63-G-LLAGS.19.2104', 161655),
(7, '1.1.5', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟฟหกง', 'I-63-G-BHKGS.19.2105', 161655),
(8, '1.1.6', '03', 'ตั้งระบบไฟพร้อมเครื่องปรับอากาศ กฟส.มห', 'I-63-G-MKLGS.19.2106', 161655),
(9, '1.1.7', '03', 'กล้องวีดีโอพร้อมอุปกรณ์ฯที่ กอก.ก.1', 'I-63-G-AMDTR.19.2107', 107700),
(10, '1.1.8', '02', 'จัดซื้อตู้นิรภัยให้ กฟอ.ท่าเรือ', 'I-63-G-TREGS.19.2108', 17664),
(11, '1.1.9', '03', 'ซื้อเครื่องนับธบัตร,ตู้นิรภัย กฟจ.ปท.', 'I-63-G-PTIGS.19.2109', 71356),
(12, '1.1.10', '', 'ยกเลิก', 'I-63-G-CAPSO.19.2110', 0),
(13, '1.1.11', '03', 'เครืองฉายภาพ LCD Projector ที่ กวว.ก.1', 'I-63-G-EAPSO.19.2110', 40000),
(14, '1.1.12', '03', 'จัดซื้อเครื่องทำน้ำเย้น ที่ กซข.ก.1', 'I-63-G-POPGS.19.2111', 6590),
(15, '1.1.13', '03', 'จัดซื้อโต๊ะและเก้าอี้ทำงานที่ กฟจ.ปท.2', 'I-63-G-PTBGS.19.2112', 399500),
(16, '1.1.14', '04', 'ติดตั้งเครื่องปรับอากาศฯที่ กฟจ.สก.', 'I-63-G-SKEGS.19.2113', 49626.17),
(17, '', '', 'รวม 1.1 I-63-G-POPXX.19.2100 ครุภัณฑ์สำนักงาน, ครุภัณฑ์เบ็ดเตล็ดอื่นๆ', '', 1846861.17),
(18, '1.2', '', 'ครุภัณฑ์สื่อสาร', 'I-63-G-POPXX.19.2200', 0),
(19, '1.2.1', '02', 'ระบบเครื่องเสียงห้องประชุมชั้น4 กฟก.1', 'I-63-G-CSDOC.19.2201', 399600),
(20, '1.2.2', '02', 'ระบบสื่อสารที่ห้องสื่อสารที่ กฟจ.สบ.', 'I-63-G-SBIGS.19.2202', 100578),
(21, '', '', 'รวม 1.2 I-63-G-POPXX.19.2200 ครุภัณฑ์สื่อสาร', '', 500178),
(22, '1.3', '', 'เครื่องมือเครื่องใช้, คลังพัสดุ', 'I-63-G-POPXX.19.2300', 0),
(23, '1.3.1', '04', 'เครืองวัดค่าความต้านทานดินให้ กฟฟ.', 'I-63-G-EAPST.19.2301', 208000),
(24, '1.3.2', '02', 'จัดซื้อล้อวัดระยะทางให้ กฟจ.ปจ.', 'I-63-G-PBICS.19.2302', 9159),
(25, '1.3.3', '02', 'เครื่องวัดค่าเพาเวอร์แฟคเตอร์ที่กฟอ.คล', 'I-63-G-KLGCS.19.2303', 40000),
(26, '1.3.4', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟย.ดอนพุด', 'I-63-G-TREOM.19.2304', 59500),
(27, '1.3.5', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.ท่าเรือ', 'I-63-G-TREOM.19.2305', 59500),
(28, '1.3.6', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟส.ผักไห่', 'I-63-G-PHIOM.19.2306', 170000),
(29, '1.3.7', '', 'ยกเลิก', 'I-63-G-DPTOM.19.2304', 0),
(30, '1.3.8', '02', 'เครื่องกำเนิดไฟฟ้าสำรองที่ กฟอ.บปอ.', 'I-63-G-BINOM.19.2307', 42000),
(31, '1.3.9', '03', 'เดรื่องมือฯ กฟจ.อย.', 'I-63-G-AYYME.19.2308', 17000),
(32, '1.3.10', '03', 'เดรื่องมือฯ กฟจ.อท.', 'I-63-G-ATGME.19.2308', 70000),
(33, '1.3.11', '03', 'เดรื่องมือฯ กฟจ.สบ.', 'I-63-G-SBIME.19.2308', 17000),
(34, '1.3.12', '03', 'เดรื่องมือฯ กฟอ.นงค.', 'I-63-G-NOKME.19.2308', 17000),
(35, '1.3.13', '03', 'เดรื่องมือฯ กฟจ.ปจ.', 'I-63-G-PBIME.19.2308', 70000),
(36, '1.3.14', '03', 'เดรื่องมือฯ กฟอ.ศม.', 'I-63-G-SPOME.19.2308', 38000),
(37, '1.3.15', '03', 'เดรื่องมือฯ กฟจ.นย.', 'I-63-G-NNKME.19.2308', 49000),
(38, '1.3.16', '03', 'เดรื่องมือฯ กฟจ.ปท.', 'I-63-G-PTIME.19.2308', 38000),
(39, '1.3.17', '03', 'เดรื่องมือฯ กฟอ.ลลก.', 'I-63-G-LLOME.19.2308', 17000),
(40, '1.3.18', '03', 'เดรื่องมือฯ กฟอ.อป.', 'I-63-G-APTME.19.2308', 49000),
(41, '1.3.19', '03', 'เดรื่องมือฯ กฟฟ.รสต.', 'I-63-G-RSTME.19.2308', 17000),
(42, '1.3.20', '03', 'เดรื่องมือฯ กฟอ.คล.', 'I-63-G-KLGME.19.2308', 38000),
(43, '1.3.21', '03', 'เดรื่องมือฯ กฟอ.สน.', 'I-63-G-SENME.19.2308', 17000),
(44, '1.3.22', '03', 'เดรื่องมือฯ กฟอ.พพบ.', 'I-63-G-PPTME.19.2308', 49000),
(45, '1.3.23', '03', 'เดรื่องมือฯ กฟอ.ทรอ.', 'I-63-G-TREME.19.2308', 17000),
(46, '1.3.24', '03', 'เดรื่องมือฯ กฟอ.กบบ.', 'I-63-G-KBRME.19.2308', 17000),
(47, '1.3.25', '03', 'เดรื่องมือฯ กฟอ.ธญ.', 'I-63-G-TYIME.19.2308', 17000),
(48, '1.3.26', '03', 'เดรื่องมือฯ กฟอ.บปอ.', 'I-63-G-BINME.19.2308', 17000),
(49, '1.3.27', '03', 'เดรื่องมือฯ กฟฟ.ปนอ.', 'I-63-G-PNIME.19.2308', 49000),
(50, '1.3.28', '03', 'เดรื่องมือฯ กฟอ.กคย.', 'I-63-G-KKIME.19.2308', 17000),
(51, '1.3.29', '03', 'เดรื่องมือฯ กฟจ.สก.', 'I-63-G-SKEME.19.2308', 17000),
(52, '1.3.30', '03', 'เครื่องมือฯ กฟฟ.ปท.2', 'I-63-G-PTBME.19.2308', 61000),
(53, '1.3.31', '03', 'เดรื่องมือฯ กฟอ.วน.', 'I-63-G-WNIME.19.2308', 38000),
(54, '1.3.32', '03', 'เดรื่องมือฯ กฟอ.ลก.', 'I-63-G-LLAME.19.2308', 49000),
(55, '1.3.33', '03', 'เดรื่องมือฯ กฟอ.หกง.', 'I-63-G-BHKME.19.2308', 17000),
(56, '1.3.34', '03', 'เดรื่องมือฯ กฟส.สคก.', 'I-63-G-SKOCM.19.2309', 27000),
(57, '1.3.35', '03', 'เดรื่องมือฯ กฟส.นสอ.', 'I-63-G-NNSCM.19.2309', 18000),
(58, '1.3.36', '03', 'เดรื่องมือฯ กฟส.ผห.', 'I-63-G-PHICM.19.2309', 27000),
(59, '1.3.37', '03', 'เดรื่องมือฯ กฟส.อ.อท.', 'I-63-G-UTHCM.19.2309', 27000),
(60, '1.3.38', '03', 'เดรื่องมือฯ กฟส.บปห.', 'I-63-G-BGHCM.19.2309', 27000),
(61, '1.3.39', '03', 'เดรื่องมือฯ กฟส.ลบล.', 'I-63-G-LLKCM.19.2309', 18000),
(62, '1.3.40', '03', 'เดรื่องมือฯ กฟส.นล.', 'I-63-G-NLGCM.19.2309', 27000),
(63, '1.3.41', '03', 'เดรื่องมือฯ กฟส.วศ.', 'I-63-G-WCNCM.19.2309', 27000),
(64, '1.3.42', '03', 'เดรื่องมือฯ กฟส.พท.', 'I-63-G-PTGCM.19.2309', 18000),
(65, '1.3.43', '03', 'เดรื่องมือฯ กฟส.ปม.', 'I-63-G-PMKCM.19.2309', 27000),
(66, '1.3.44', '03', 'เดรื่องมือฯ กฟส.นด.', 'I-63-G-NADCM.19.2309', 27000),
(67, '1.3.45', '03', 'เดรื่องมือฯ กฟส.บน.', 'I-63-G-BNACM.19.2309', 27000),
(68, '1.3.46', '03', 'เดรื่องมือฯ กฟส.อร.', 'I-63-G-OKKCM.19.2309', 18000),
(69, '1.3.47', '03', 'เดรื่องมือฯ กฟส.วฒ.', 'I-63-G-WTNCM.19.2309', 18000),
(70, '1.3.48', '03', 'เดรื่องมือฯ กฟส.วนย.', 'I-63-G-WNNCM.19.2309', 27000),
(71, '1.3.49', '03', 'เดรื่องมือฯ กฟส.บส.', 'I-63-G-BSGCM.19.2309', 18000),
(72, '1.3.50', '03', 'เดรื่องมือฯ กฟส.วด.', 'I-63-G-WDGCM.19.2309', 27000),
(73, '1.3.51', '03', 'เดรื่องมือฯ กฟส.มห.', 'I-63-G-MKLCM.19.2309', 27000),
(74, '1.3.52', '03', 'เดรื่องมือฯ กฟส.ปจค.', 'I-63-G-PCMCM.19.2309', 27000),
(75, '1.3.53', '03', 'เดรื่องมือฯ กฟย.ภาชี', 'I-63-G-NLGCM.19.2310', 55000),
(76, '1.3.54', '03', 'เดรื่องมือฯ กฟย.มหาราช,กฟย.บ้านแพรก', 'I-63-G-BGHCM.19.2310', 46000),
(77, '1.3.55', '03', 'เดรื่องมือฯ กฟย.ไชโย', 'I-63-G-ATGME.19.2310', 66000),
(78, '1.3.56', '03', 'เดรื่องมือฯ กฟย.สามโก้', 'I-63-G-WCNCM.19.2310', 23000),
(79, '1.3.57', '03', 'เดรื่องมือฯ กฟย.แสวงหา', 'I-63-G-PTGCM.19.2310', 49000),
(80, '1.3.58', '03', 'เดรื่องมือฯ กฟย.เสาไห้,กฟย.หนองแซง', 'I-63-G-SBIME.19.2310', 72000),
(81, '1.3.59', '03', 'เดรื่องมือฯ กฟย.ปากพลี', 'I-63-G-NNKME.19.2310', 23000),
(82, '1.3.60', '03', 'เดรื่องมือฯ กฟย.ตาพระยา,กฟย.โคกสูง', 'I-63-G-APTME.19.2310', 46000),
(83, '1.3.61', '03', 'เดรื่องมือฯ กฟย.คลองหาด', 'I-63-G-WTNCM.19.2310', 23000),
(84, '1.3.62', '03', 'เดรื่องมือฯ กฟย.บางบาล,บางซ้าย', 'I-63-G-SENME.19.2310', 78000),
(85, '1.3.63', '03', 'เดรื่องมือฯ กฟย.บางไทร', 'I-63-G-LLKCM.19.2310', 23000),
(86, '1.3.64', '03', 'เดรื่องมือฯ กฟย.หนองโดน', 'I-63-G-PPTME.19.2310', 23000),
(87, '1.3.65', '03', 'เดรื่องมือฯ กฟย.บ้านหมอ,กฟย.ดอนพุด', 'I-63-G-TREME.19.2310', 132000),
(88, '1.3.66', '03', 'เดรื่องมือฯ กฟย.วังตะเคียน', 'I-63-G-KBRME.19.2310', 23000),
(89, '1.3.67', '03', 'เดรื่องมือฯ กฟย.วังม่วง,กฟย.ซับสนุ่น', 'I-63-G-MKLCM.19.2310', 46000),
(90, '1.3.68', '03', 'เดรื่องมือฯ กฟย.เขาฉกรรณ์', 'I-63-G-SKEME.19.2310', 61000),
(91, '1.3.69', '03', 'เดรื่องมือฯ กฟย.วังสมบูรณ์', 'I-63-G-WNNCM.19.2310', 67000),
(92, '1.3.70', '03', 'เดรื่องมือฯ กฟย.ศรีมโหสถ,กฟย.ท่าตูม', 'I-63-G-SPOME.19.2310', 84000),
(93, '1.3.71', '04', 'เครื่องมือต่อสายลงดินแรงสูง ให้ กวว.ก1', 'I-63-G-EAPSO.19.2311', 105000),
(94, '1.3.72', '04', 'เครื่องมือไม้ชักฟิวส์ ให้ กวว.ก.1', 'I-63-G-EAPSO.19.2312', 66000),
(95, '1.3.73', '04', 'จัดซื้อเครื่องวัดแสงสว่างที่ กวว.ก.1', 'I-63-G-EAPSO.19.2313', 17500),
(96, '1.3.74', '04', 'จัดซื้อไม้ชักฟิวส์ที่ กฟอ.ลก.', 'I-63-G-LLAOM.19.2314', 22000),
(97, '', '', 'รวม 1.3 I-63-G-POPXX.19.2300 เครื่องมือเครื่องใช้, คลังพัสดุ', '', 3016659),
(98, '1.4', '', 'คอมพิวเตอร์', 'I-63-G-POPXX.19.2400', 0),
(99, '1.5', '', 'ยานพาหนะ', 'I-63-G-POPXX.19.2500', 0),
(100, '1.6', '', 'ที่ดิน, ปรับปรุงที่ดิน', 'I-63-G-POPXX.19.2600', 0),
(101, '1.7', '', 'สิ่งก่อสร้าง', 'I-63-G-POPXX.19.2700', 0),
(102, '1.8', '', 'ต่อเติม, ปรับปรุง', 'I-63-G-POPXX.19.2800', 0),
(103, '1.8.1', '06', 'ปป.ผนังภายนอก อาคาร1ด้านหน้า กฟก.1', 'I-63-G-CAPCW.19.2801', 458600),
(104, '', '', 'รวม 1.8 I-63-G-POPXX.19.2800 ต่อเติม, ปรับปรุง', '', 458600),
(105, '1.9', '', 'ขยายเขต', 'I-63-G-POPXX.19.2900', 0),
(106, '1.9.1', '06', 'กส.ระบจำหน่ายติดตั้งหม้อแปลงฯกฟฟ.บกด.', 'I-63-G-PTBGS.19.2901', 51482.4),
(107, '', '', 'รวม 1.9 I-63-G-POPXX.19.2900 ขยายเขต', '', 51482.4),
(108, '', '', 'รวม 1 I-63-G-POPXX.19.2000 เร่งด่วน-อนุมัติจาก อข.', '', 35000000),
(109, '', '', 'รวมทั้งสิ้น', '', 35000000);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `alert`
--
ALTER TABLE `alert`
  ADD PRIMARY KEY (`alert_id`);

--
-- Indexes for table `data_dic_ref`
--
ALTER TABLE `data_dic_ref`
  ADD PRIMARY KEY (`data_dic_ref_id`);

--
-- Indexes for table `empolyee`
--
ALTER TABLE `empolyee`
  ADD PRIMARY KEY (`id_user`);

--
-- Indexes for table `task_user`
--
ALTER TABLE `task_user`
  ADD PRIMARY KEY (`task_user_id`);

--
-- Indexes for table `tb_092563`
--
ALTER TABLE `tb_092563`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `template_tb`
--
ALTER TABLE `template_tb`
  ADD PRIMARY KEY (`template_id`);

--
-- Indexes for table `testfield_count`
--
ALTER TABLE `testfield_count`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `testfrgdhgdhgh`
--
ALTER TABLE `testfrgdhgdhgh`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `test_json`
--
ALTER TABLE `test_json`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `token_line`
--
ALTER TABLE `token_line`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `userpea`
--
ALTER TABLE `userpea`
  ADD PRIMARY KEY (`id_pea`);

--
-- Indexes for table `งบเร่งด่วนมกรา`
--
ALTER TABLE `งบเร่งด่วนมกรา`
  ADD PRIMARY KEY (`table_name_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `alert`
--
ALTER TABLE `alert`
  MODIFY `alert_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `data_dic_ref`
--
ALTER TABLE `data_dic_ref`
  MODIFY `data_dic_ref_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `empolyee`
--
ALTER TABLE `empolyee`
  MODIFY `id_user` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `task_user`
--
ALTER TABLE `task_user`
  MODIFY `task_user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK', AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `tb_092563`
--
ALTER TABLE `tb_092563`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=287;

--
-- AUTO_INCREMENT for table `template_tb`
--
ALTER TABLE `template_tb`
  MODIFY `template_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `testfield_count`
--
ALTER TABLE `testfield_count`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `testfrgdhgdhgh`
--
ALTER TABLE `testfrgdhgdhgh`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=287;

--
-- AUTO_INCREMENT for table `test_json`
--
ALTER TABLE `test_json`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `token_line`
--
ALTER TABLE `token_line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `userpea`
--
ALTER TABLE `userpea`
  MODIFY `id_pea` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `งบเร่งด่วนมกรา`
--
ALTER TABLE `งบเร่งด่วนมกรา`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
